{
  "_meta": {
    "version": "3.1",
    "last_updated": "2026-02-20",
    "description": "NPCs: service, quest, class_master, ambient. Enriched profiles with dialogues, shop inventory, bilingual text."
  },

  "types": ["service", "quest", "class_master", "ambient", "arena"],
  "priorities": ["essential", "important", "flavor"],

  "service_npcs": [
    {
      "id": "npc_healer_aelina",
      "name_fr": "Soeur Aelina",
      "name_en": "Sister Aelina",
      "role_fr": "Soigneuse",
      "role_en": "Healer",
      "services": ["heal_full", "cleanse_basic"],
      "location": "town_start",

      "lore_fr": "Aelina a grandi dans un monastère au nord, où on lui a appris à soigner avant de parler. Elle est partie le jour où les tremblements ont commencé. Personne ne sait exactement pourquoi. Elle dit que les Abysses respirent sous la terre, que quelque chose pousse vers la surface. Les gens la trouvent étrange, mais quand ils saignent, c'est toujours elle qu'ils cherchent.",
      "lore_en": "Aelina grew up in a northern monastery, where she was taught to heal before she could speak. She left the day the tremors started. No one knows exactly why. She says the Abysses breathe beneath the earth, that something is pushing toward the surface. People find her strange, but when they bleed, she's always the one they look for.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Tu es blessé ? Approche, je m'occupe de ça.",
              "Je suis là pour soigner, pas pour poser des questions.",
              "Encore des gens abîmés par la route. Viens, montre-moi."
            ],
            "lines_en": [
              "Are you hurt? Come closer, I'll take care of it.",
              "I'm here to heal, not to ask questions.",
              "More people broken by the road. Come, show me."
            ]
          },
          {
            "zone": "zone_forest",
            "lines_fr": [
              "Le poison de ces bêtes est vicieux. Viens, je peux encore faire quelque chose.",
              "Cette forêt rend les gens malades. Pas juste le corps, l'esprit aussi."
            ],
            "lines_en": [
              "The venom from these creatures is vicious. Come, I can still do something.",
              "This forest makes people sick. Not just the body, the mind too."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Au monastère, on disait que la douleur est un message. Moi je dis que c'est surtout un problème à régler.",
              "Les tremblements sous la terre se sont calmés, mais ils reviendront. Je le sens.",
              "Il y a des jours où je soigne plus de gens que la veille. Ça veut dire que quelque chose empire.",
              "Je ne demande pas d'or pour soigner. Mais si tu en as, ça m'aide à rester ici.",
              "Certains pensent que je suis prêtresse. Je ne suis rien du tout. Je sais juste refermer les plaies."
            ],
            "lines_en": [
              "At the monastery, they said pain is a message. I say it's mostly a problem to fix.",
              "The tremors underground have quieted, but they'll come back. I can feel it.",
              "Some days I heal more people than the day before. That means something's getting worse.",
              "I don't ask for gold to heal. But if you have some, it helps me stay here.",
              "Some think I'm a priestess. I'm nothing at all. I just know how to close wounds."
            ]
          },
          {
            "zone": "zone_forest",
            "lines_fr": [
              "J'ai vu des blessures de cette forêt qui ne cicatrisent pas normalement. Quelque chose dans l'air, peut-être.",
              "Les loups d'ici ne chassaient pas les gens avant. Maintenant si. Le monde se détraque."
            ],
            "lines_en": [
              "I've seen wounds from this forest that don't heal normally. Something in the air, maybe.",
              "The wolves here didn't hunt people before. Now they do. The world is coming apart."
            ]
          }
        ],
        "heal": [
          {
            "lines_fr": [
              "Voilà, c'est fait. Essaie de ne pas revenir trop vite.",
              "Tes blessures sont refermées. Le reste, c'est du repos."
            ],
            "lines_en": [
              "There, it's done. Try not to come back too soon.",
              "Your wounds are closed. The rest is just rest."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Prends soin de toi. Je serai là si ça tourne mal.",
              "Va. Et si tu croises quelqu'un de blessé sur la route, dis-lui où me trouver."
            ],
            "lines_en": [
              "Take care of yourself. I'll be here if things go wrong.",
              "Go. And if you meet someone hurt on the road, tell them where to find me."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_vendor_milo",
      "name_fr": "Milo",
      "name_en": "Milo",
      "role_fr": "Marchand",
      "role_en": "Merchant",
      "services": ["buy_sell_general", "sell_junk_auto"],
      "location": "town_start",

      "lore_fr": "Milo n'a jamais tenu une épée de sa vie. Ancien colporteur des routes du sud, il a appris très jeune que les gens qui se battent ont toujours besoin de quelqu'un qui ne se bat pas. Il s'est installé là où les ennuis commencent, pas par courage, mais parce que c'est là que l'or circule. Il connaît le prix de chaque chose, et le coût de chaque erreur. Il ne juge personne. Il vend.",
      "lore_en": "Milo has never held a sword in his life. A former peddler from the southern roads, he learned early that people who fight always need someone who doesn't. He set up shop where trouble begins, not out of courage, but because that's where gold flows. He knows the price of everything, and the cost of every mistake. He doesn't judge. He sells.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Tiens, un visage que j'ai pas encore vu. T'as besoin de quelque chose ou tu fais que passer ?",
              "Le monde change dehors, mais ici les prix restent les mêmes. Pour l'instant.",
              "J'ai ce qu'il faut pour tenir debout. Le reste, c'est ton affaire."
            ],
            "lines_en": [
              "Well, a face I haven't seen yet. Need something or just passing through?",
              "The world's changing out there, but prices stay the same in here. For now.",
              "I've got what you need to stay on your feet. The rest is your business."
            ]
          },
          {
            "zone": "zone_forest",
            "lines_fr": [
              "Les bêtes de cette forêt mordent plus fort qu'avant. Fais le plein, crois-moi.",
              "J'ai suivi la route jusqu'ici. Tant qu'il y a des gens, il y a du commerce."
            ],
            "lines_en": [
              "The beasts in this forest bite harder than before. Stock up, trust me.",
              "I followed the road here. Where there's people, there's trade."
            ]
          }
        ],
        "buy": [
          {
            "lines_fr": [
              "Regarde, tout est là. Pas de surprises, pas d'arnaques.",
              "Prends ce qu'il te faut. Je fais pas crédit."
            ],
            "lines_en": [
              "Have a look, it's all here. No surprises, no tricks.",
              "Take what you need. I don't do credit."
            ]
          }
        ],
        "sell": [
          {
            "lines_fr": [
              "Voyons ce que t'as... Je rachète tout, mais au juste prix.",
              "Pose ça là. Je te donne ce que ça vaut, ni plus ni moins."
            ],
            "lines_en": [
              "Let's see what you've got... I'll buy anything, but at a fair price.",
              "Put it down. I'll give you what it's worth, no more no less."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Fais attention dehors. Les morts, ça achète rien.",
              "Reviens quand t'as besoin. Je bouge pas."
            ],
            "lines_en": [
              "Watch yourself out there. Dead folks don't buy anything.",
              "Come back when you need me. I'm not going anywhere."
            ]
          }
        ]
      },

      "shop_inventory": {
        "_comment": "Items available for purchase. Organized by category. All prices from consumables.json.",
        "potions": [
          {"item_id": "cons_hp_potion_small", "stock": -1, "min_level": 1},
          {"item_id": "cons_hp_potion_medium", "stock": -1, "min_level": 10},
          {"item_id": "cons_hp_potion_large", "stock": -1, "min_level": 25},
          {"item_id": "cons_mp_potion_small", "stock": -1, "min_level": 1},
          {"item_id": "cons_mp_potion_medium", "stock": -1, "min_level": 10},
          {"item_id": "cons_mp_potion_large", "stock": -1, "min_level": 25},
          {"item_id": "cons_antidote", "stock": -1, "min_level": 1},
          {"item_id": "cons_cleanse_potion", "stock": -1, "min_level": 15},
          {"item_id": "revive_potion", "stock": 5, "min_level": 20, "restock_hours": 24}
        ],
        "food": [
          {"item_id": "food_bread", "stock": -1, "min_level": 1},
          {"item_id": "food_apple", "stock": -1, "min_level": 1},
          {"item_id": "food_meat_skewer", "stock": -1, "min_level": 5},
          {"item_id": "food_fish_grilled", "stock": -1, "min_level": 5}
        ]
      },

      "buy_config": {
        "accepts": ["equipment", "materials", "consumables", "junk"],
        "sell_price_ratio": 0.35,
        "junk_auto_sell": true
      }
    },
    {
      "id": "npc_blacksmith_borin",
      "name_fr": "Borin",
      "name_en": "Borin",
      "role_fr": "Forgeron",
      "role_en": "Blacksmith",
      "services": ["repair", "upgrade_weapon", "craft_basic"],
      "location": "town_start",

      "lore_fr": "Borin a été mercenaire pendant douze ans. Il a arrêté le jour où il a pris un coup de hache dans le genou gauche. Depuis, il forge. Il dit que c'est le même métier : on tape sur du métal jusqu'à ce qu'il prenne la bonne forme. Il parle peu, observe beaucoup, et refuse de forger pour ceux qui ne prennent pas soin de leur équipement.",
      "lore_en": "Borin was a mercenary for twelve years. He stopped the day he took an axe to his left knee. Since then, he forges. He says it's the same job: you hit metal until it takes the right shape. He talks little, watches a lot, and refuses to forge for those who don't take care of their gear.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "T'as quelque chose à réparer ou tu viens juste regarder ?",
              "Pose ton arme sur le comptoir. Je te dis ce que j'en pense.",
              "Si ça coupe plus, c'est pas une arme. C'est un bâton."
            ],
            "lines_en": [
              "Got something to repair or just here to watch?",
              "Put your weapon on the counter. I'll tell you what I think.",
              "If it doesn't cut anymore, it's not a weapon. It's a stick."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "J'ai forgé des lames pour des gens qui sont jamais revenus les chercher. J'essaie de pas trop y penser.",
              "Le fer de cette région est correct. Pas le meilleur, mais il tient. Comme les gens d'ici.",
              "Un bon forgeron, c'est pas celui qui fait la plus belle lame. C'est celui dont la lame revient en un seul morceau.",
              "Mon genou me fait mal quand le temps change. Ça m'a sauvé plus d'une fois, en fait. Je sais quand la pluie arrive.",
              "Les gobelins fabriquent des armes aussi. C'est moche, c'est tordu, mais ça fait mal quand même. Faut pas les sous-estimer."
            ],
            "lines_en": [
              "I've forged blades for people who never came back to pick them up. I try not to think about it too much.",
              "The iron around here is decent. Not the best, but it holds. Like the people here.",
              "A good blacksmith isn't the one who makes the prettiest blade. It's the one whose blade comes back in one piece.",
              "My knee aches when the weather changes. It's actually saved me more than once. I know when rain's coming.",
              "Goblins make weapons too. Ugly, crooked, but they still hurt. Don't underestimate them."
            ]
          },
          {
            "zone": "zone_forest",
            "lines_fr": [
              "Le bois des arbres ici est dur comme la pierre. Si tu ramènes du bon bois, je peux en faire des manches solides.",
              "Les griffes de loup, ça vaut rien en forge. Mais les crocs, ça c'est un autre sujet."
            ],
            "lines_en": [
              "The wood from these trees is hard as stone. Bring me some good timber and I can make solid handles.",
              "Wolf claws are worthless for forging. But the fangs, that's another story."
            ]
          }
        ],
        "repair": [
          {
            "lines_fr": [
              "C'est fait. Tâche de pas la casser dans l'heure.",
              "J'ai vu pire. Mais pas souvent."
            ],
            "lines_en": [
              "It's done. Try not to break it within the hour.",
              "I've seen worse. But not often."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Garde ton arme affûtée. Le reste, ça te regarde.",
              "Si ça casse, tu sais où me trouver."
            ],
            "lines_en": [
              "Keep your weapon sharp. The rest is your business.",
              "If it breaks, you know where to find me."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_leatherworker_sana",
      "name_fr": "Sana",
      "name_en": "Sana",
      "role_fr": "Tanneuse",
      "role_en": "Leatherworker",
      "services": ["craft_light_armor", "upgrade_armor_light"],
      "location": "town_start",

      "lore_fr": "Sana reconnaît chaque bête à la texture de sa peau. Elle a grandi dans un village de chasseurs à l'est, où on apprenait à dépecer avant d'apprendre à lire. Elle est venue en ville quand les bêtes ont commencé à descendre des collines. Elle dit que les peaux changent, qu'elles deviennent plus épaisses, plus sombres. Que les animaux s'adaptent à quelque chose qu'on ne voit pas encore.",
      "lore_en": "Sana can tell any beast by the texture of its hide. She grew up in a hunting village to the east, where you learned to skin before you learned to read. She came to town when the beasts started coming down from the hills. She says the hides are changing, getting thicker, darker. That the animals are adapting to something we can't see yet.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Tu as des peaux à travailler ? Montre-moi ce que tu rapportes.",
              "Si c'est du cuir que tu cherches, t'es au bon endroit.",
              "Je fais dans le léger. Si tu veux du métal, va voir Borin."
            ],
            "lines_en": [
              "Got hides to work? Show me what you've brought.",
              "If it's leather you're looking for, you're in the right place.",
              "I work with light materials. If you want metal, go see Borin."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Les peaux de rat, c'est de la camelote. Mais avec dix, je peux quand même en tirer quelque chose.",
              "La fourrure de loup, c'est ce que j'ai de mieux en ce moment. Souple, résistante. Parfait pour les éclaireurs.",
              "Mon père disait qu'on peut juger une région à la qualité de ses bêtes. Ici, c'est pas mauvais.",
              "Le cuir de sanglier, faut le travailler longtemps. Mais une fois prêt, ça arrête une flèche.",
              "Tu sens cette odeur ? C'est le tannin. On s'y habitue. Ou pas."
            ],
            "lines_en": [
              "Rat hides are junk. But with ten of them, I can still make something.",
              "Wolf fur is the best I've got right now. Supple, tough. Perfect for scouts.",
              "My father said you can judge a region by the quality of its beasts. This place isn't bad.",
              "Boar leather takes a long time to work. But once it's ready, it stops an arrow.",
              "You smell that? That's tannin. You get used to it. Or you don't."
            ]
          },
          {
            "zone": "zone_forest",
            "lines_fr": [
              "Les araignées de cette forêt produisent une soie incroyable. Si tu en ramènes, je peux en faire du fil solide.",
              "Les peaux qu'on ramène d'ici ont une teinte bizarre. Plus foncée que la normale."
            ],
            "lines_en": [
              "The spiders in this forest produce incredible silk. Bring me some and I can make strong thread.",
              "The hides people bring back from here have a strange tint. Darker than normal."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Ramène-moi des peaux si t'en trouves. Je les refuse jamais.",
              "Bonne chasse. Et pense à viser la tête, ça abîme moins le cuir."
            ],
            "lines_en": [
              "Bring me hides if you find any. I never turn them down.",
              "Good hunting. And aim for the head, it damages the leather less."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_enchanter_lyr",
      "name_fr": "Lyr",
      "name_en": "Lyr",
      "role_fr": "Enchanteur",
      "role_en": "Enchanter",
      "services": ["enchant_basic", "reroll_affix"],
      "location": "town_start",

      "lore_fr": "Lyr écrit des formules sur tout ce qui lui tombe sous la main : papier, pierre, métal, et parfois des gens. Il a été renvoyé de trois académies différentes pour avoir \"trop expérimenté\". Il dit que la magie n'est pas un don, c'est une grammaire, et que la plupart des gens ne savent pas lire. Il bégaie un peu quand il parle, mais jamais quand il incante.",
      "lore_en": "Lyr writes formulas on anything he can get his hands on: paper, stone, metal, and sometimes people. He was expelled from three different academies for 'excessive experimentation.' He says magic isn't a gift, it's a grammar, and most people can't read. He stutters a bit when he talks, but never when he casts.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Ah, tu veux un enchantement ? Pose ton objet là, je... je regarde ce que je peux faire.",
              "Chaque objet a un potentiel caché. Moi, je le réveille. Enfin, j'essaie.",
              "Si tu veux du brut, va chez Borin. Si tu veux de l'intelligent, reste ici."
            ],
            "lines_en": [
              "Ah, you want an enchantment? Put your item there, I'll... I'll see what I can do.",
              "Every item has hidden potential. I wake it up. Well, I try.",
              "If you want brute force, go to Borin. If you want something clever, stay here."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "La troisième académie, c'était pas ma faute. Le mur a explosé tout seul. Enfin, presque.",
              "Un bon enchantement, c'est comme une phrase bien construite. Sujet, verbe, pouvoir. Simple.",
              "Les gens veulent toujours plus de dégâts. Personne demande jamais un enchantement de résistance. C'est dommage.",
              "J'ai essayé d'enchanter un chat une fois. Ça a... pas bien fini. Le chat va bien. La table, moins.",
              "Chaque affixe qu'on change, c'est un risque. Mais le risque, c'est ce qui rend les choses intéressantes."
            ],
            "lines_en": [
              "The third academy wasn't my fault. The wall exploded on its own. Well, almost.",
              "A good enchantment is like a well-built sentence. Subject, verb, power. Simple.",
              "People always want more damage. Nobody ever asks for a resistance enchantment. That's a shame.",
              "I tried enchanting a cat once. It... didn't end well. The cat's fine. The table, less so.",
              "Every affix you change is a risk. But risk is what makes things interesting."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Fais attention avec ça. Les enchantements, ça se respecte.",
              "Reviens quand tu veux. J'ai toujours de nouvelles formules à tester."
            ],
            "lines_en": [
              "Be careful with that. Enchantments deserve respect.",
              "Come back anytime. I've always got new formulas to test."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_banker_orsen",
      "name_fr": "Orsen",
      "name_en": "Orsen",
      "role_fr": "Banquier",
      "role_en": "Banker",
      "services": ["storage", "currency_exchange"],
      "location": "town_start",

      "lore_fr": "Orsen ne fait confiance qu'aux chiffres. Il a travaillé pour des nobles, des marchands, et au moins un voleur notoire. Il ne fait pas de différence entre les trois. L'or, c'est l'or. Il garde tes affaires en lieu sûr et ne pose jamais de questions, sauf quand il s'agit du prix.",
      "lore_en": "Orsen only trusts numbers. He's worked for nobles, merchants, and at least one notorious thief. He doesn't see the difference between the three. Gold is gold. He keeps your things safe and never asks questions, except when it comes to the price.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Dépôt ou retrait ?",
              "Ton coffre est toujours là. Comme moi.",
              "Tu veux stocker quelque chose ? Ou récupérer ?"
            ],
            "lines_en": [
              "Deposit or withdrawal?",
              "Your vault is still here. Just like me.",
              "Want to store something? Or pick up?"
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Les gens cachent leur or sous leur lit et s'étonnent de se faire voler. Moi, je propose un mur en pierre et une serrure.",
              "J'ai compté l'or de ce village hier. Il y en a moins qu'il y a un mois. Ça veut dire que les gens dépensent plus qu'ils ne gagnent.",
              "Un noble m'a confié une boîte scellée il y a trois ans. Il n'est jamais revenu. La boîte est toujours là.",
              "Je ne juge pas ce que tu stockes. Je juge juste si tu peux payer le coffre.",
              "L'or ne résout pas tout. Mais ça résout la plupart des problèmes que j'ai vus."
            ],
            "lines_en": [
              "People hide their gold under their bed and wonder why they get robbed. I offer a stone wall and a lock.",
              "I counted this village's gold yesterday. There's less than a month ago. Means people spend more than they earn.",
              "A noble entrusted me with a sealed box three years ago. He never came back. The box is still here.",
              "I don't judge what you store. I just judge whether you can pay for the vault.",
              "Gold doesn't fix everything. But it fixes most problems I've seen."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Ton coffre sera là quand tu reviendras.",
              "Pas de reçu. Ma parole suffit."
            ],
            "lines_en": [
              "Your vault will be here when you get back.",
              "No receipt. My word is enough."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_alchemist_petra",
      "name_fr": "Petra",
      "name_en": "Petra",
      "role_fr": "Alchimiste",
      "role_en": "Alchemist",
      "services": ["potions_advanced", "antidotes"],
      "location": "town_start",

      "lore_fr": "Petra croit que chaque poison est un remède qui a oublié son nom. Elle a passé dix ans à voyager pour étudier les plantes, les venins et les champignons. Elle est revenue avec des cicatrices aux mains et un savoir que personne d'autre n'a dans la région. Elle parle de ses mixtures comme d'autres parlent de leurs enfants.",
      "lore_en": "Petra believes every poison is a remedy that forgot its name. She spent ten years traveling to study plants, venoms, and mushrooms. She came back with scars on her hands and knowledge no one else in the region has. She talks about her mixtures the way others talk about their children.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Empoisonné ? Brûlé ? Maudit ? Dis-moi tout, j'ai sûrement quelque chose.",
              "Bienvenue dans mon atelier. Touche à rien.",
              "Si tu cherches des potions de base, va chez Milo. Moi, je fais du sur-mesure."
            ],
            "lines_en": [
              "Poisoned? Burned? Cursed? Tell me everything, I probably have something.",
              "Welcome to my workshop. Don't touch anything.",
              "If you're looking for basic potions, go to Milo. I do custom work."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Le gel de slime, les gens trouvent ça dégoûtant. Moi j'y vois un excellent catalyseur.",
              "J'ai goûté tous mes antidotes. C'est la seule façon d'être sûre qu'ils marchent. Ne fais pas cette tête.",
              "Les champignons de la cave du village sont fascinants. Toxiques, oui, mais fascinants.",
              "Un jour je trouverai un remède universel. En attendant, j'ai des antidotes spécialisés.",
              "Les brûlures de slime sont les plus vicieuses. Ça a l'air de rien, et trois jours plus tard tu perds la peau."
            ],
            "lines_en": [
              "Slime gel, people think it's disgusting. I see an excellent catalyst.",
              "I've tasted all my antidotes. It's the only way to be sure they work. Don't make that face.",
              "The mushrooms in the village cellar are fascinating. Toxic, yes, but fascinating.",
              "Someday I'll find a universal remedy. In the meantime, I have specialized antidotes.",
              "Slime burns are the nastiest. Looks like nothing, then three days later your skin peels off."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Attention aux champignons sur le chemin. Si c'est violet, touche pas.",
              "Reviens si t'as des ingrédients rares. Je paye bien pour ce qui m'intéresse."
            ],
            "lines_en": [
              "Watch out for mushrooms on the road. If it's purple, don't touch it.",
              "Come back if you have rare ingredients. I pay well for what interests me."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_pet_master_koru",
      "name_fr": "Koru",
      "name_en": "Koru",
      "role_fr": "Dresseur",
      "role_en": "Tamer",
      "services": ["pet_manage", "pet_food"],
      "location": "town_start",

      "lore_fr": "Koru prétend qu'un bon familier choisit aussi son maître. Il a toujours un animal à ses côtés, jamais le même deux semaines de suite. Il a grandi seul dans les collines, entouré de bêtes, et comprend leurs comportements mieux que ceux des gens. Il est un peu maladroit avec les mots, mais il suffit de voir comment les animaux réagissent autour de lui.",
      "lore_en": "Koru claims a good pet also chooses its master. He always has an animal by his side, never the same one two weeks in a row. He grew up alone in the hills, surrounded by beasts, and understands their behavior better than people's. He's a bit clumsy with words, but you only need to see how animals react around him.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Tu viens pour ton familier ? Ou tu veux en découvrir un nouveau ?",
              "Les bêtes sont calmes aujourd'hui. C'est bon signe.",
              "Chaque créature a quelque chose à offrir. Faut juste savoir écouter."
            ],
            "lines_en": [
              "Here for your pet? Or looking to discover a new one?",
              "The beasts are calm today. That's a good sign.",
              "Every creature has something to offer. You just have to listen."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Les rats, tout le monde les déteste. Mais apprivoisé, un rat c'est loyal, rapide, et ça mange presque rien.",
              "J'ai essayé de dresser un slime une fois. Ça a fonctionné trois jours. Après il a mangé ma chaussure.",
              "Un loup bien nourri ne mord pas son maître. Un loup mal nourri ne mord personne longtemps.",
              "Les gens traitent mal leurs familiers et se demandent pourquoi ils obéissent pas. C'est pas compliqué.",
              "Tu savais que les sangliers ronronnent quand ils sont contents ? C'est un grondement sourd. Très apaisant."
            ],
            "lines_en": [
              "Rats, everyone hates them. But tamed, a rat is loyal, fast, and barely eats.",
              "I tried taming a slime once. It worked for three days. Then it ate my shoe.",
              "A well-fed wolf doesn't bite its master. A starving wolf doesn't bite anyone for long.",
              "People mistreat their pets then wonder why they don't obey. It's not complicated.",
              "Did you know boars purr when they're happy? It's a low rumble. Very soothing."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Prends soin de tes compagnons. Ils prennent soin de toi en retour.",
              "Si tu trouves une bête blessée dehors, ramène-la. Je m'en occupe."
            ],
            "lines_en": [
              "Take care of your companions. They take care of you in return.",
              "If you find a wounded beast outside, bring it back. I'll take care of it."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_teleporter_elle",
      "name_fr": "Elle",
      "name_en": "Elle",
      "role_fr": "Voyageuse",
      "role_en": "Wayfarer",
      "services": ["fast_travel", "zone_info"],
      "location": "town_start",

      "lore_fr": "Elle voyage léger. Trop léger, disent certains. Elle connaît des raccourcis que personne d'autre ne connaît, des passages entre les zones que les cartes ne montrent pas. Elle dit que les routes changent la nuit, que le monde bouge quand personne ne regarde. Les gens la paient pour voyager vite, et elle ne refuse jamais. Mais personne ne sait d'où elle vient, ni comment elle fait.",
      "lore_en": "Elle travels light. Too light, some say. She knows shortcuts no one else knows, passages between zones that maps don't show. She says roads change at night, that the world shifts when no one's looking. People pay her to travel fast, and she never refuses. But no one knows where she's from, or how she does it.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Tu veux aller quelque part ? Dis-moi où, je connais le chemin.",
              "Les routes sont calmes aujourd'hui. Bon moment pour voyager.",
              "J'ai des passages vers tous les endroits que t'as déjà visités. Intéressé ?"
            ],
            "lines_en": [
              "Want to go somewhere? Tell me where, I know the way.",
              "The roads are quiet today. Good time to travel.",
              "I've got passages to every place you've already visited. Interested?"
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Les chemins ne sont pas fixes. La plupart des gens ne le remarquent pas, mais moi oui.",
              "J'ai marché dans des endroits qui n'existent plus le lendemain. Ça rend humble.",
              "Le voyage le plus court n'est pas toujours le plus sûr. Mais c'est celui que les gens choisissent.",
              "Il y a des zones où même moi je n'irai pas. Pas par peur. Par respect.",
              "Tu veux un conseil ? Découvre chaque zone à pied d'abord. Après, je peux t'y ramener en un instant."
            ],
            "lines_en": [
              "Paths aren't fixed. Most people don't notice, but I do.",
              "I've walked through places that don't exist the next day. It keeps you humble.",
              "The shortest route isn't always the safest. But it's the one people choose.",
              "There are zones where even I won't go. Not out of fear. Out of respect.",
              "Want some advice? Discover each zone on foot first. After that, I can bring you back in an instant."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Bon voyage. Et regarde où tu mets les pieds.",
              "Les routes changent. Pas moi. Tu me trouveras toujours ici."
            ],
            "lines_en": [
              "Safe travels. And watch your step.",
              "Roads change. I don't. You'll always find me here."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_innkeeper_rona",
      "name_fr": "Rona",
      "name_en": "Rona",
      "role_fr": "Tavernière",
      "role_en": "Innkeeper",
      "services": ["rest_buff", "rumors"],
      "location": "town_start",

      "lore_fr": "Rona écoute tout et n'oublie rien. Sa taverne est le seul endroit du village où tout le monde se mélange : marchands, gardes, gens de passage, et ceux qui essaient d'oublier ce qu'ils ont vu dehors. Elle sert de la bière tiède et des rumeurs fraîches. Les gens disent que ses informations valent plus que l'or. Elle, elle dit qu'elle fait juste la conversation.",
      "lore_en": "Rona listens to everything and forgets nothing. Her tavern is the only place in the village where everyone mixes: merchants, guards, travelers, and those trying to forget what they saw outside. She serves warm beer and fresh rumors. People say her information is worth more than gold. She says she's just making conversation.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Installe-toi. Tu veux boire un coup ou juste te reposer ?",
              "T'as une sale tête. Assieds-toi, je t'apporte quelque chose.",
              "Bienvenue. Ici, on juge personne. Sauf ceux qui renversent leur verre."
            ],
            "lines_en": [
              "Sit down. Want a drink or just some rest?",
              "You look terrible. Have a seat, I'll bring you something.",
              "Welcome. No judgment here. Except for those who spill their drink."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Un garde m'a dit que les patrouilles trouvent des traces bizarres au nord. Des marques dans la terre, profondes.",
              "Y'a un type qui vient tous les soirs. Il commande une bière, la fixe sans boire, et repart. Jamais compris pourquoi.",
              "Les fermiers se plaignent que les récoltes sont moins bonnes cette saison. Pas le climat. Autre chose.",
              "Milo me doit trois bières. Il pense que j'ai oublié. J'oublie jamais.",
              "Si tu cherches des ennuis, va au nord. Si tu cherches la paix, reste ici et commande."
            ],
            "lines_en": [
              "A guard told me the patrols are finding strange tracks up north. Marks in the ground, deep ones.",
              "There's a guy who comes every night. Orders a beer, stares at it without drinking, then leaves. Never understood why.",
              "The farmers are complaining the harvest is worse this season. Not the weather. Something else.",
              "Milo owes me three beers. He thinks I forgot. I never forget.",
              "If you're looking for trouble, head north. If you want peace, stay here and order."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Repose-toi bien. Et reviens quand t'as soif.",
              "Ma porte est toujours ouverte. Sauf la nuit. Là, faut frapper."
            ],
            "lines_en": [
              "Rest well. And come back when you're thirsty.",
              "My door's always open. Except at night. Then you knock."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_materials_buyer_juno",
      "name_fr": "Juno",
      "name_en": "Juno",
      "role_fr": "Acheteuse de Matériaux",
      "role_en": "Materials Buyer",
      "services": ["buy_materials", "weekly_requests"],
      "location": "town_start",

      "lore_fr": "Juno finance les artisans et rachète les matériaux bruts à quiconque en rapporte. Elle a horreur du gaspillage et organise tout avec une précision maniaque. Elle tient un carnet où elle note chaque transaction depuis cinq ans. Elle dit que le vrai trésor, ce n'est pas l'or, c'est un inventaire bien rangé.",
      "lore_en": "Juno funds artisans and buys raw materials from anyone who brings them in. She hates waste and organizes everything with obsessive precision. She keeps a ledger where she's noted every transaction for the past five years. She says the real treasure isn't gold, it's a well-organized inventory.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "T'as des matériaux ? Fais voir, je te dis combien ça vaut.",
              "Je rachète tout ce qui est utile. Et presque tout est utile.",
              "Si c'est propre et bien conservé, je paye mieux. Fais un effort."
            ],
            "lines_en": [
              "Got materials? Show me, I'll tell you what they're worth.",
              "I buy anything useful. And almost everything is useful.",
              "If it's clean and well-preserved, I pay more. Make an effort."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "La queue de rat, ça vaut pas grand-chose à l'unité. Mais en quantité, ça fait tourner l'atelier de Sana.",
              "J'ai une commande hebdomadaire pour Borin. Si tu ramènes ce qu'il faut, y'a un bonus.",
              "Les gens jettent les os et les carapaces. Moi, je les rachète. Rien ne devrait se perdre.",
              "Mon carnet a cinq ans de transactions. Si quelqu'un me ment sur un prix, je le sais.",
              "Le slime, c'est ce qui se vend le mieux en ce moment. Petra en veut toujours plus."
            ],
            "lines_en": [
              "Rat tails aren't worth much each. But in quantity, they keep Sana's workshop running.",
              "I've got a weekly order for Borin. Bring what he needs and there's a bonus.",
              "People throw away bones and shells. I buy them. Nothing should go to waste.",
              "My ledger has five years of transactions. If someone lies to me about a price, I know.",
              "Slime is what sells best right now. Petra always wants more."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Ramène-moi des matériaux et on s'entendra bien.",
              "Bonne chasse. Et trie avant de revenir, ça ira plus vite."
            ],
            "lines_en": [
              "Bring me materials and we'll get along fine.",
              "Good hunting. And sort your stuff before coming back, it'll be faster."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_lore_oracle_mara",
      "name_fr": "Mara",
      "name_en": "Mara",
      "role_fr": "Oracle",
      "role_en": "Oracle",
      "services": ["lore_codex", "daily_hint"],
      "location": "town_start",

      "lore_fr": "Mara voit des fragments de futurs possibles. Elle ne dit jamais lequel est vrai. Les gens viennent la consulter par curiosité, par peur, ou par désespoir. Elle répond toujours, mais ses réponses ne sont jamais claires. Elle vit à l'écart, dans un coin du village où les enfants n'osent pas aller. Elle ne demande rien en échange, ce qui inquiète plus les gens que si elle demandait de l'or.",
      "lore_en": "Mara sees fragments of possible futures. She never says which one is true. People come to her out of curiosity, fear, or desperation. She always answers, but her answers are never clear. She lives apart, in a corner of the village where children don't dare go. She asks for nothing in return, which worries people more than if she asked for gold.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Tu viens chercher des réponses ? Je n'en ai pas. Juste des fragments.",
              "Approche. Le codex a peut-être quelque chose pour toi.",
              "Certains jours, je vois plus clairement. Aujourd'hui... c'est flou."
            ],
            "lines_en": [
              "Looking for answers? I don't have any. Just fragments.",
              "Come closer. The codex might have something for you.",
              "Some days I see more clearly. Today... it's blurry."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "J'ai vu un futur où ce village n'existe plus. J'en ai vu un autre où il est devenu une ville. Les deux sont possibles.",
              "Les Abysses ne dorment pas. Elles attendent. Ce n'est pas pareil.",
              "Les gens me demandent si les choses vont s'arranger. Je leur dis de se préparer, c'est plus utile.",
              "Le monde change que tu le veuilles ou non. La seule question, c'est ce que tu fais pendant.",
              "J'ai vu ton visage avant que tu arrives. Pas clairement. Juste une silhouette. Ça arrive parfois."
            ],
            "lines_en": [
              "I've seen a future where this village no longer exists. I've seen another where it became a city. Both are possible.",
              "The Abysses aren't sleeping. They're waiting. It's not the same thing.",
              "People ask me if things will get better. I tell them to prepare, that's more useful.",
              "The world changes whether you want it to or not. The only question is what you do in the meantime.",
              "I saw your face before you arrived. Not clearly. Just a silhouette. It happens sometimes."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Va. Et ne crois pas tout ce que je dis. Même moi, je ne sais pas ce qui est vrai.",
              "Le futur n'est pas écrit. Pas encore."
            ],
            "lines_en": [
              "Go. And don't believe everything I say. Even I don't know what's true.",
              "The future isn't written. Not yet."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_guild_master_aldric",
      "name_fr": "Aldric",
      "name_en": "Aldric",
      "role_fr": "Maître de Guilde",
      "role_en": "Guild Master",
      "services": ["guild_create", "guild_manage", "guild_wars"],
      "location": "town_start",

      "lore_fr": "Aldric a vu des guildes naître et mourir. Des alliances se former en une nuit et s'effondrer en un jour. Il ne se fait pas d'illusions sur la loyauté des gens, mais il respecte ceux qui tiennent. Il gère les registres, les chartes, et les conflits entre guildes. Il dit que créer une guilde, c'est facile. La garder debout, c'est le vrai travail.",
      "lore_en": "Aldric has seen guilds born and die. Alliances formed in a night and shattered in a day. He has no illusions about people's loyalty, but he respects those who endure. He manages the registries, charters, and conflicts between guilds. He says creating a guild is easy. Keeping it standing is the real work.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Tu veux créer une guilde ? Ou en rejoindre une ?",
              "Les registres sont ouverts. Dis-moi ce que tu cherches.",
              "Une guilde, c'est pas juste un nom. C'est des gens qui comptent les uns sur les autres."
            ],
            "lines_en": [
              "Want to create a guild? Or join one?",
              "The registries are open. Tell me what you're looking for.",
              "A guild isn't just a name. It's people counting on each other."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "J'ai vu une guilde de cinquante membres s'effondrer parce que le chef a disparu un matin. C'est tout ce qu'il faut.",
              "Créer une guilde coûte 50 000 pièces d'or. C'est cher, oui. Mais ça filtre ceux qui ne sont pas sérieux.",
              "Les guerres de guildes, c'est compliqué. C'est pas juste de la force. C'est de l'organisation, de la stratégie.",
              "Le coffre de guilde, c'est là où la confiance se mesure. Si les gens volent dedans, la guilde est déjà morte.",
              "Les meilleures guildes que j'ai vues n'étaient pas les plus fortes. C'étaient celles où les gens se parlaient."
            ],
            "lines_en": [
              "I've seen a guild of fifty collapse because the leader disappeared one morning. That's all it takes.",
              "Creating a guild costs 50,000 gold. Expensive, yes. But it filters out those who aren't serious.",
              "Guild wars are complicated. It's not just strength. It's organization, strategy.",
              "The guild vault is where trust is measured. If people steal from it, the guild is already dead.",
              "The best guilds I've seen weren't the strongest. They were the ones where people talked to each other."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Bonne chance. Et souviens-toi : une guilde, ça se construit pas en un jour.",
              "Les registres sont toujours ouverts. Reviens quand tu es prêt."
            ],
            "lines_en": [
              "Good luck. And remember: a guild isn't built in a day.",
              "The registries are always open. Come back when you're ready."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_koro_collector_yuki",
      "name_fr": "Yuki",
      "name_en": "Yuki",
      "role_fr": "Collectrice de Koros",
      "role_en": "Koro Collector",
      "services": ["koro_identify", "koro_fusion", "koro_trade", "koro_codex"],
      "location": "town_start",

      "lore_fr": "Yuki collectionne les Koros depuis l'enfance. Elle dit que chaque carte porte l'écho d'un combat ancien, une technique figée dans le temps. Elle connaît chaque rang, chaque pouvoir, chaque combinaison possible. Les gens la trouvent obsédée. Elle dit que c'est de la passion. La différence ? Elle n'a pas encore trouvé.",
      "lore_en": "Yuki has collected Koros since childhood. She says each card carries the echo of an ancient battle, a technique frozen in time. She knows every rank, every power, every possible combination. People think she's obsessed. She says it's passion. The difference? She hasn't figured that out yet.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Tu as des Koros ? Montre-moi, montre-moi !",
              "Bienvenue ! Le codex est ouvert. Tu veux identifier ou fusionner ?",
              "Chaque Koro raconte une histoire. Tu veux l'entendre ?"
            ],
            "lines_en": [
              "Do you have Koros? Show me, show me!",
              "Welcome! The codex is open. Want to identify or fuse?",
              "Every Koro tells a story. Want to hear it?"
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Les Koros de rang C sont communs, mais certaines combinaisons C+C donnent des résultats surprenants.",
              "J'ai vu un Koro de rang SS une fois. Une seule fois. Le type qui l'avait ne savait même pas ce qu'il possédait.",
              "La fusion, c'est un pari. Parfois tu montes en rang, parfois tu perds tout. C'est pour ça que c'est excitant.",
              "Les Koros ne sont pas juste des cartes. C'est des techniques de combat d'un autre âge. Compressées, figées, prêtes à être libérées.",
              "Mon rêve ? Un codex complet. Toutes les cartes. Je sais que c'est impossible. Mais c'est ça qui rend la chose belle."
            ],
            "lines_en": [
              "C-rank Koros are common, but some C+C combinations give surprising results.",
              "I saw an SS-rank Koro once. Just once. The guy who had it didn't even know what he was holding.",
              "Fusion is a gamble. Sometimes you rank up, sometimes you lose everything. That's what makes it exciting.",
              "Koros aren't just cards. They're combat techniques from another age. Compressed, frozen, ready to be unleashed.",
              "My dream? A complete codex. Every card. I know it's impossible. But that's what makes it beautiful."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Si tu trouves des Koros en route, ne les jette pas ! Ramène-les-moi !",
              "Bonne chance. Et si tu vois une carte qui brille, c'est au moins rang A."
            ],
            "lines_en": [
              "If you find Koros on the road, don't throw them away! Bring them to me!",
              "Good luck. And if you see a card that glows, it's at least A-rank."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_respec_sage_velith",
      "name_fr": "Velith",
      "name_en": "Velith",
      "role_fr": "Sage",
      "role_en": "Sage",
      "services": ["stat_reset", "skill_reset"],
      "location": "town_start",

      "lore_fr": "Velith peut effacer tes choix passés, mais pas leurs conséquences. C'est ce qu'il dit à chaque personne qui vient le voir. Il a étudié les flux d'énergie du corps pendant des décennies et sait comment réaligner ce que d'autres ont construit de travers. Chaque réinitialisation coûte plus cher que la précédente. Il dit que c'est pour décourager l'indécision. En vérité, c'est parce que le processus l'épuise.",
      "lore_en": "Velith can erase your past choices, but not their consequences. That's what he tells everyone who comes to see him. He studied the body's energy flows for decades and knows how to realign what others have built crooked. Each reset costs more than the last. He says it's to discourage indecision. In truth, it's because the process exhausts him.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Tu veux recommencer ? C'est possible. Pas gratuit, mais possible.",
              "Les choix qu'on regrette, c'est humain. Moi, je peux les défaire.",
              "Réfléchis bien avant de me demander. Une fois que c'est fait, c'est fait."
            ],
            "lines_en": [
              "Want to start over? It's possible. Not free, but possible.",
              "Regretting choices is human. I can undo them.",
              "Think carefully before you ask. Once it's done, it's done."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "La première réinitialisation coûte 1 000 or. La deuxième, 2 000. Et ainsi de suite. C'est pas de la cruauté. C'est de la sagesse.",
              "J'ai vu des gens changer de voie cinq fois et finir plus perdus qu'au début. Le changement n'est pas toujours la solution.",
              "Ton corps se souvient de ce qu'il a appris, même quand je le réinitialise. C'est pour ça que tu gardes tes niveaux.",
              "Il y a des jours où je me demande si ce que je fais est bien. Puis quelqu'un revient plus fort, et je me dis que oui.",
              "Le plus dur, c'est pas de défaire les choix. C'est de savoir quels nouveaux choix faire après."
            ],
            "lines_en": [
              "The first reset costs 1,000 gold. The second, 2,000. And so on. It's not cruelty. It's wisdom.",
              "I've seen people change paths five times and end up more lost than when they started. Change isn't always the answer.",
              "Your body remembers what it learned, even when I reset it. That's why you keep your levels.",
              "Some days I wonder if what I do is right. Then someone comes back stronger, and I think it is.",
              "The hardest part isn't undoing choices. It's knowing which new choices to make after."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Va, et construis mieux cette fois.",
              "Prends le temps de réfléchir. Tu sais où me trouver."
            ],
            "lines_en": [
              "Go, and build better this time.",
              "Take your time to think. You know where to find me."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_daily_reward_herald",
      "name_fr": "Théo",
      "name_en": "Theo",
      "role_fr": "Héraut",
      "role_en": "Herald",
      "services": ["daily_reward_claim", "weekly_bonus"],
      "location": "town_start",

      "lore_fr": "Théo distribue les faveurs du royaume à ceux qui se présentent chaque jour. Personne ne sait exactement qui le paie ni pourquoi, mais il est toujours là, toujours souriant, avec son sac rempli de récompenses. Il ne juge jamais ceux qui arrivent en retard. Il dit que la constance, c'est tout ce qui compte, et que même un jour manqué ne casse pas la chaîne.",
      "lore_en": "Theo distributes the kingdom's favors to those who show up each day. No one knows exactly who pays him or why, but he's always there, always smiling, bag full of rewards. He never judges latecomers. He says consistency is all that matters, and that even a missed day doesn't break the chain.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Hé, te voilà ! J'ai quelque chose pour toi aujourd'hui.",
              "Chaque jour compte. Et aujourd'hui, ça compte double si tu reviens demain.",
              "Pile à l'heure. Ou pas. C'est pas grave, je suis encore là."
            ],
            "lines_en": [
              "Hey, there you are! I've got something for you today.",
              "Every day counts. And today counts double if you come back tomorrow.",
              "Right on time. Or not. Doesn't matter, I'm still here."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Qui me paie ? Bonne question. Je reçois un sac tous les matins devant ma porte. Jamais vu qui le pose.",
              "T'inquiète pas si tu manques un jour. La série ne se casse pas. C'est la règle.",
              "Y'a un bonus en fin de semaine pour ceux qui viennent régulièrement. Rien d'énorme, mais ça fait plaisir.",
              "Je fais ce travail depuis deux ans. Pas une journée de manquée. Je sais même pas si j'ai le droit d'en manquer une.",
              "Certains viennent juste pour discuter, pas pour la récompense. Ça me va aussi."
            ],
            "lines_en": [
              "Who pays me? Good question. I get a bag every morning at my door. Never seen who leaves it.",
              "Don't worry if you miss a day. The streak doesn't break. That's the rule.",
              "There's a weekly bonus for regulars. Nothing huge, but it feels nice.",
              "I've been doing this job for two years. Haven't missed a single day. Not even sure if I'm allowed to miss one.",
              "Some people come just to chat, not for the reward. That's fine by me too."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "À demain ! Enfin, quand tu veux. Mais demain c'est bien.",
              "Prends soin de toi. Et reviens, hein."
            ],
            "lines_en": [
              "See you tomorrow! Well, whenever. But tomorrow's good.",
              "Take care. And come back, yeah?"
            ]
          }
        ]
      }
    }
  ],

  "quest_npcs": [
    {
      "id": "npc_guide_nina",
      "name_fr": "Nina",
      "name_en": "Nina",
      "role_fr": "Guide",
      "role_en": "Guide",
      "services": ["tutorial", "starter_quest"],
      "location": "town_start",

      "lore_fr": "Nina a vu trop de gens mourir bêtement pour laisser les choses au hasard. Elle n'est pas patiente, pas douce, et ne mâche pas ses mots. Mais ceux qui l'écoutent survivent plus longtemps que les autres. Elle enseigne les bases : comment se battre, comment lire une situation, comment ne pas mourir dans les cinq premières minutes.",
      "lore_en": "Nina has seen too many people die stupidly to leave things to chance. She's not patient, not gentle, and doesn't mince words. But those who listen to her survive longer than the rest. She teaches the basics: how to fight, how to read a situation, how not to die in the first five minutes.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Nouveau ? Suis-moi. Je vais t'expliquer comment ne pas mourir.",
              "T'as l'air perdu. C'est normal. Tout le monde l'est au début.",
              "Je vais pas te dire que c'est facile dehors. Mais si tu m'écoutes, t'as une chance."
            ],
            "lines_en": [
              "New? Follow me. I'll show you how not to die.",
              "You look lost. That's normal. Everyone is at first.",
              "I won't tell you it's easy out there. But if you listen to me, you have a chance."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Le combat ici, c'est une grille. Deux équipes, cinq de chaque côté. Ta position compte autant que ta force.",
              "Ne sous-estime jamais les rats. Seuls, c'est rien. En groupe, c'est une autre histoire.",
              "Apprends tes compétences, toutes. Et choisis bien où mettre tes points. Y'en a pas assez pour tout.",
              "J'ai formé des dizaines de gens. La moitié est encore en vie. C'est un bon ratio, crois-moi.",
              "Quand le monde change, ceux qui s'adaptent survivent. Les autres, je les retrouve à la sortie de la forêt."
            ],
            "lines_en": [
              "Combat here is a grid. Two teams, five on each side. Your position matters as much as your strength.",
              "Never underestimate rats. Alone, they're nothing. In a group, that's another story.",
              "Learn your skills, all of them. And choose carefully where to put your points. There aren't enough for everything.",
              "I've trained dozens of people. Half of them are still alive. That's a good ratio, trust me.",
              "When the world changes, those who adapt survive. The others, I find them at the edge of the forest."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Souviens-toi de ce que je t'ai appris. Ça pourrait te sauver.",
              "Va. Et reviens si t'as besoin d'un rappel."
            ],
            "lines_en": [
              "Remember what I taught you. It might save you.",
              "Go. And come back if you need a refresher."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_quest_captain_rey",
      "name_fr": "Capitaine Rey",
      "name_en": "Captain Rey",
      "role_fr": "Capitaine de la Garde",
      "role_en": "Guard Captain",
      "services": ["quest_hub"],
      "location": "town_start",

      "lore_fr": "Le Capitaine Rey maintient le village debout avec de la discipline et des primes bien placées. Il n'est pas du genre à envoyer ses gardes faire le sale boulot si quelqu'un d'autre peut s'en charger. Il affiche les missions, fixe les récompenses, et note ceux qui reviennent. Il dit que la sécurité, c'est pas son travail. C'est celui de tout le monde.",
      "lore_en": "Captain Rey keeps the village standing with discipline and well-placed bounties. He's not the type to send his guards to do the dirty work when someone else can handle it. He posts the missions, sets the rewards, and notes who comes back. He says security isn't his job. It's everyone's.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Le tableau des missions est là. Prends ce qui te correspond.",
              "T'as l'air capable. J'ai du travail pour toi si ça t'intéresse.",
              "Les menaces changent chaque semaine. Les missions aussi."
            ],
            "lines_en": [
              "The mission board is right there. Take what suits you.",
              "You look capable. I've got work for you if you're interested.",
              "Threats change every week. So do the missions."
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Mes gardes font ce qu'ils peuvent, mais ils sont pas assez nombreux. C'est pour ça que je poste des primes.",
              "Les gobelins au sud deviennent plus organisés. Ça m'inquiète. Les gobelins organisés, c'est jamais bon signe.",
              "Y'a des élites qui rôdent dans la forêt. Pas pour les débutants. Mais si t'es prêt, la récompense vaut le risque.",
              "Je note tout. Qui prend les missions, qui les finit, qui revient pas. Ça me donne une idée de ce qui se passe dehors.",
              "La sécurité du village, c'est pas juste mes gardes. C'est chaque personne qui sort et qui revient avec un monstre de moins."
            ],
            "lines_en": [
              "My guards do what they can, but there aren't enough of them. That's why I post bounties.",
              "The goblins to the south are getting more organized. That worries me. Organized goblins are never a good sign.",
              "There are elites prowling the forest. Not for beginners. But if you're ready, the reward is worth the risk.",
              "I write everything down. Who takes missions, who finishes them, who doesn't come back. Gives me a picture of what's happening out there.",
              "Village security isn't just my guards. It's every person who goes out and comes back with one less monster."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Bonne chasse. Et ramène des preuves si tu veux la prime.",
              "Reviens en un seul morceau. Les morts ne remplissent pas les missions."
            ],
            "lines_en": [
              "Good hunting. And bring proof if you want the bounty.",
              "Come back in one piece. Dead people don't complete missions."
            ]
          }
        ]
      }
    }
  ],

  "class_masters": [
    {
      "id": "npc_class_warrior",
      "name_fr": "Maître Kael",
      "name_en": "Master Kael",
      "role_fr": "Maître d'Armes",
      "role_en": "Weapon Master",
      "class": "warrior",

      "lore_fr": "Kael ne parle pas beaucoup. Il regarde ta posture, puis ton courage. Il a combattu dans trois guerres et survécu aux trois. Il dit que la force brute ne sert à rien si tu sais pas où frapper. Il enseigne la discipline avant la puissance.",
      "lore_en": "Kael doesn't talk much. He watches your stance, then your courage. He fought in three wars and survived all three. He says brute force is useless if you don't know where to hit. He teaches discipline before power.",

      "dialogues": {
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "La force sans contrôle, c'est du bruit. Le vrai guerrier frappe une fois, au bon endroit.",
              "Ton bouclier, c'est pas un accessoire. C'est ce qui te sépare de la mort.",
              "J'ai vu des gars deux fois plus forts que toi mourir parce qu'ils gardaient pas leur garde.",
              "Le Guardian protège. Le Berserker détruit. Le Warlord commande. Trouve ta voie."
            ],
            "lines_en": [
              "Strength without control is just noise. A real warrior strikes once, in the right spot.",
              "Your shield isn't an accessory. It's what stands between you and death.",
              "I've seen men twice your strength die because they dropped their guard.",
              "The Guardian protects. The Berserker destroys. The Warlord commands. Find your path."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_class_mage",
      "name_fr": "Archimage Selene",
      "name_en": "Archmage Selene",
      "role_fr": "Archimage",
      "role_en": "Archmage",
      "class": "mage",

      "lore_fr": "Selene prétend que la magie est une mémoire du monde, pas une force. Elle parle par énigmes et s'énerve quand on lui demande de simplifier. Elle a quitté l'académie pour enseigner ici, au milieu de rien. Elle dit que c'est plus honnête qu'une tour d'ivoire.",
      "lore_en": "Selene claims magic is a memory of the world, not a force. She speaks in riddles and gets annoyed when asked to simplify. She left the academy to teach here, in the middle of nowhere. She says it's more honest than an ivory tower.",

      "dialogues": {
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "La magie n'est pas un don. C'est un langage. Et la plupart des gens ne savent même pas qu'il existe.",
              "L'Élémentaliste dompte la matière. L'Occultiste dompte l'esprit. Le Spellblade fait les deux mal. Je plaisante. À peine.",
              "Chaque sort a un coût. Pas juste en Souffle. En concentration, en volonté. Ne l'oublie pas.",
              "Les gens veulent des boules de feu. Moi je dis qu'un bon Silence vaut dix boules de feu."
            ],
            "lines_en": [
              "Magic isn't a gift. It's a language. And most people don't even know it exists.",
              "The Elementalist tames matter. The Occultist tames the mind. The Spellblade does both poorly. I'm joking. Barely.",
              "Every spell has a cost. Not just in Breath. In focus, in will. Don't forget that.",
              "People want fireballs. I say a good Silence is worth ten fireballs."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_class_archer",
      "name_fr": "Éclaireuse Veya",
      "name_en": "Scout Veya",
      "role_fr": "Éclaireuse",
      "role_en": "Scout",
      "class": "archer",

      "lore_fr": "Veya lit les traces comme d'autres lisent des livres. Elle déteste le bruit inutile et peut rester immobile pendant des heures. Elle a vécu seule dans la forêt pendant deux ans avant de revenir au village. Elle dit que la distance, c'est une arme. Plus tu es loin, plus tu vois clair.",
      "lore_en": "Veya reads tracks like others read books. She hates unnecessary noise and can stay motionless for hours. She lived alone in the forest for two years before returning to the village. She says distance is a weapon. The farther you are, the clearer you see.",

      "dialogues": {
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Le Ranger surveille. Le Falconer traque. Le Gunslinger frappe fort. Le Ballmaster... rebondit. Trouve ton style.",
              "Si t'es en première ligne, t'as déjà perdu. L'archer reste derrière et contrôle le terrain.",
              "Un bon tir, c'est pas de la chance. C'est des heures de pratique et un souffle maîtrisé.",
              "Écoute la forêt. Si les oiseaux se taisent, quelque chose approche."
            ],
            "lines_en": [
              "The Ranger watches. The Falconer hunts. The Gunslinger hits hard. The Ballmaster... bounces. Find your style.",
              "If you're on the front line, you've already lost. Archers stay back and control the field.",
              "A good shot isn't luck. It's hours of practice and controlled breathing.",
              "Listen to the forest. If the birds go quiet, something's coming."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_class_rogue",
      "name_fr": "Rask",
      "name_en": "Rask",
      "role_fr": "Maître des Ombres",
      "role_en": "Shadow Master",
      "class": "rogue",

      "lore_fr": "Rask enseigne comment disparaître, mais surtout comment revenir au bon moment. Personne ne connaît son vrai nom ni son passé. Il est apparu au village un jour et a commencé à former des gens. Il dit que la discrétion, c'est pas de la lâcheté. C'est de l'intelligence.",
      "lore_en": "Rask teaches how to disappear, but especially how to come back at the right time. No one knows his real name or his past. He showed up in the village one day and started training people. He says stealth isn't cowardice. It's intelligence.",

      "dialogues": {
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Le Shadowblade frappe vite et fort. Le Trickster embrouille. Le Corsair pille. Le Duelist joue propre. À toi de choisir.",
              "La meilleure attaque, c'est celle que personne ne voit venir.",
              "Les gens pensent que les voleurs sont malhonnêtes. C'est faux. Les meilleurs voleurs sont les plus honnêtes avec eux-mêmes.",
              "Si ton ennemi te cherche, tu as déjà gagné la moitié du combat."
            ],
            "lines_en": [
              "The Shadowblade strikes fast and hard. The Trickster confuses. The Corsair plunders. The Duelist plays fair. Your choice.",
              "The best attack is the one no one sees coming.",
              "People think rogues are dishonest. That's wrong. The best rogues are the most honest with themselves.",
              "If your enemy is looking for you, you've already won half the fight."
            ]
          }
        ]
      }
    },
    {
      "id": "npc_class_healer",
      "name_fr": "Mère Iona",
      "name_en": "Mother Iona",
      "role_fr": "Doyenne",
      "role_en": "Elder",
      "class": "healer",

      "lore_fr": "Mère Iona parle peu et écoute beaucoup. Elle a vu la panique tuer plus de gens que les monstres. Elle enseigne la patience, le timing, et surtout le calme sous pression. Elle dit que soigner n'est pas un acte de bonté. C'est un acte de lucidité.",
      "lore_en": "Mother Iona speaks little and listens much. She's seen panic kill more people than monsters. She teaches patience, timing, and above all, calm under pressure. She says healing isn't an act of kindness. It's an act of clarity.",

      "dialogues": {
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Le Lifewarden protège par les soins. Le Lightbringer purifie. Le Martyr sacrifie. Le Cantor inspire. Chaque voie a un prix.",
              "Le soin ne te rend pas invincible. Il te donne du temps. Ce que tu fais de ce temps, c'est ton affaire.",
              "En combat, le soigneur meurt en premier si l'équipe ne le protège pas. Retiens ça.",
              "La patience sauve plus de vies que la puissance. Toujours."
            ],
            "lines_en": [
              "The Lifewarden protects through healing. The Lightbringer purifies. The Martyr sacrifices. The Cantor inspires. Every path has a price.",
              "Healing doesn't make you invincible. It gives you time. What you do with that time is your business.",
              "In combat, the healer dies first if the team doesn't protect them. Remember that.",
              "Patience saves more lives than power. Always."
            ]
          }
        ]
      }
    }
  ],

  "arena_npcs": [
    {
      "id": "npc_arena_dargo",
      "name_fr": "Dargo",
      "name_en": "Dargo",
      "role_fr": "Maître d'Arène",
      "role_en": "Arena Master",
      "services": ["arena_pve_trials", "ladder"],
      "location": "town_start",

      "lore_fr": "Dargo aime les règles simples : entre, bats-toi, sors. Il a construit l'arène lui-même avec du bois et de la sueur. C'est un ancien combattant de fosse, couvert de cicatrices, qui parle fort et rit plus fort. Il organise les épreuves, tient le classement, et encourage même ceux qui perdent. Il dit que perdre dans l'arène, c'est mieux que perdre dehors.",
      "lore_en": "Dargo likes simple rules: enter, fight, leave. He built the arena himself with wood and sweat. A former pit fighter covered in scars, he speaks loud and laughs louder. He runs the trials, keeps the rankings, and cheers even for those who lose. He says losing in the arena is better than losing out there.",

      "dialogues": {
        "greeting": [
          {
            "zone": "town_start",
            "lines_fr": [
              "Tu viens te battre ? Parfait. L'arène est ouverte.",
              "Pas besoin de raison pour combattre ici. Juste l'envie de se mesurer.",
              "Le classement est affiché là-bas. Tu veux monter dedans ?"
            ],
            "lines_en": [
              "Here to fight? Perfect. The arena's open.",
              "No reason needed to fight here. Just the will to test yourself.",
              "Rankings are posted over there. Want to climb them?"
            ]
          }
        ],
        "talk": [
          {
            "zone": "town_start",
            "lines_fr": [
              "J'ai construit cette arène quand j'ai compris que les gens avaient besoin de se battre sans conséquences.",
              "Les épreuves sont progressives. Mannequin d'abord, puis des packs, puis un boss. Simple.",
              "Le classement, c'est pas une question de force. C'est une question de régularité. Les meilleurs reviennent tous les jours.",
              "J'ai perdu plus de combats que j'en ai gagné. C'est comme ça qu'on apprend.",
              "L'arène, c'est le seul endroit où tu peux échouer sans que ça coûte quoi que ce soit. Profites-en."
            ],
            "lines_en": [
              "I built this arena when I realized people needed to fight without consequences.",
              "The trials are progressive. Dummy first, then packs, then a boss. Simple.",
              "Rankings aren't about strength. They're about consistency. The best ones come back every day.",
              "I've lost more fights than I've won. That's how you learn.",
              "The arena is the only place where you can fail without it costing anything. Take advantage of it."
            ]
          }
        ],
        "farewell": [
          {
            "lines_fr": [
              "Bon combat. Reviens quand tu veux en reprendre.",
              "T'as du potentiel. Travaille-le."
            ],
            "lines_en": [
              "Good fight. Come back when you want another round.",
              "You've got potential. Work on it."
            ]
          }
        ]
      }
    }
  ],

  "ambient_npcs": [
    {"id": "amb_villager_01", "name": "Villager", "type": "standing", "day_night": "day"},
    {"id": "amb_guard_01", "name": "Patrolling Guard", "type": "patrol", "day_night": "any"},
    {"id": "amb_child_01", "name": "Running Child", "type": "running", "day_night": "day"},
    {"id": "amb_cat_01", "name": "Market Cat", "type": "idle", "day_night": "any"},
    {"id": "amb_dog_01", "name": "Wandering Dog", "type": "wander", "day_night": "any"},
    {"id": "amb_farmer_01", "name": "Farmer", "type": "carry", "day_night": "day"},
    {"id": "amb_tavern_patron_01", "name": "Tavern Patron", "type": "sitting", "day_night": "night"},
    {"id": "amb_priest_01", "name": "Praying Faithful", "type": "kneeling", "day_night": "any"},
    {"id": "amb_fisher_01", "name": "Silent Fisher", "type": "fishing", "day_night": "day"},
    {"id": "amb_messenger_01", "name": "Hurrying Messenger", "type": "running", "day_night": "any"}
  ],

  "services_catalog": {
    "heal_full": "Restore HP/MP to max out of combat",
    "cleanse_basic": "Remove basic negative effects (poison, burn, bleed)",
    "buy_sell_general": "Buy loot, sell basic consumables",
    "sell_junk_auto": "Quick sell junk items",
    "repair": "Repair damaged equipment",
    "upgrade_weapon": "Enhance weapon stats",
    "craft_basic": "Create basic weapons from zone materials",
    "craft_light_armor": "Create light armor for Ranger/Rogue/Healer",
    "enchant_basic": "Add simple bonus (atk/mag/def) on item",
    "reroll_affix": "Reroll an affix (gold + mats cost)",
    "storage": "Secure storage, slot extension",
    "fast_travel": "Teleport between discovered points",
    "zone_info": "Zone description and danger level",
    "tutorial": "Explains UI, 2x5 combat, skills, status",
    "quest_hub": "Centralized hunting, elite, boss missions",
    "arena_pve_trials": "Instanced test fights (DPS dummy, packs, boss)",
    "stat_reset": "Recover all allocated stat points",
    "daily_reward_claim": "Claim daily reward (anti-FOMO: streak doesn't reset)",
    "koro_identify": "Reveal Koro rank and power",
    "koro_fusion": "Combine identical Koros to increase rank",
    "guild_create": "Found a guild (50,000 gold, level 20 min)",
    "guild_manage": "Access guild options: members, ranks, storage"
  },

  "_summary": {
    "total_npcs": 35,
    "service": 16,
    "quest": 2,
    "class_master": 5,
    "arena": 1,
    "ambient": 10
  }
}
