{
  "_meta": {
    "version": "3.1",
    "last_updated": "2026-01-31",
    "description": "Index des 6 classes jouables avec subclasses et lore",
    "description_en": "Index of 6 playable classes with subclasses and lore",
    "total_classes": 6,
    "total_subclasses": 24,
    "total_tier3": 48
  },

  "classes": [
    {
      "id": "warrior",
      "name": "Warrior",
      "role": "tank_melee",
      "primary_stat": "atk",
      "identity": "Frontline melee bruiser/tank + taunt + row/column pressure",
      "tagline": "Rempart indestructible",
      "tagline_en": "Indestructible Bulwark",
      "description": "Le Guerrier est le pilier de toute formation. Il attire l'attention des ennemis, protège ses alliés et frappe avec une force dévastatrice.",
      "description_en": "The Warrior is the pillar of any formation. He draws enemy attention, protects allies and strikes with devastating force.",
      "lore": "Forgés dans les guerres contre les Fissures, les Guerriers sont les derniers remparts de la civilisation. Leur Souffle, c'est leur endurance, leur volonté de tenir quand tout s'effondre.",
      "lore_en": "Forged in wars against the Rifts, Warriors are civilization's last bulwarks. Their Breath is their endurance, their will to stand when everything crumbles.",
      "difficulty": "easy",
      "recommended_for": ["beginners", "tanks", "frontline"],
      "wiki_intro": "Le Guerrier est la classe idéale pour ceux qui veulent être au cœur de l'action. Robuste et résilient, il excelle à protéger ses alliés en attirant l'attention des ennemis. Que vous préfériez absorber les dégâts comme un Guardian indestructible ou déchaîner votre rage comme un Berserker sanguinaire, le Guerrier offre une expérience de combat viscéral et gratifiante. Sa position en première ligne lui permet de contrôler le rythme du combat et de créer des ouvertures pour son équipe.",
      "wiki_intro_en": "The Warrior is the ideal class for those who want to be at the heart of the action. Sturdy and resilient, they excel at protecting allies by drawing enemy attention. Whether you prefer absorbing damage as an indestructible Guardian or unleashing your rage as a bloodthirsty Berserker, the Warrior offers a visceral and rewarding combat experience. Their frontline position allows them to control the pace of battle and create openings for their team.",
      "playstyle_tips": ["Positionnez-vous en première ligne", "Utilisez Taunt pour protéger vos alliés fragiles", "Gérez vos cooldowns défensifs pour les moments critiques"],
      "playstyle_tips_en": ["Position yourself on the frontline", "Use Taunt to protect fragile allies", "Manage defensive cooldowns for critical moments"],
      "skills_file": "warrior/skills.json",
      "passives_file": "warrior/passives.json",
      "subclasses": [
        {
          "id": "guardian",
          "name": "Guardian",
          "identity": "Pure tank protector + shields + team mitigation",
          "signature_skill": "aegis_breaker",
          "tagline": "Rempart vivant",
          "tagline_en": "Living Bulwark",
          "description": "Le Guardian protège ses alliés coûte que coûte, attirant la fureur ennemie et absorbant des dégâts mortels.",
          "description_en": "The Guardian protects allies at all costs, drawing enemy fury and absorbing deadly damage.",
          "lore": "Héritiers des anciens remparts, les Guardians sont le dernier mur entre les Fissures et le monde civilisé. Ils encaissent pour que les autres n'aient pas à le faire.",
          "lore_en": "Heirs of ancient bulwarks, Guardians are the last wall between the Rifts and the civilized world. They take the hit so others don't have to.",
          "fissure_relation": "The wall between the Rifts and the civilized world",
          "souffle_usage": "Breath fuels raw endurance and the will to hold the line",
          "tier3": [
            {"id": "bulwark", "identity": "Immovable fortress + extreme self-defense + damage immunity windows", "signature": "Last Bastion"},
            {"id": "sentinel", "identity": "Guardian angel + ally protection specialist + damage redirection", "signature": "Phalanx"}
          ]
        },
        {
          "id": "berserker",
          "name": "Berserker",
          "identity": "Bruiser DPS + self-buff rage + row pressure",
          "signature_skill": "decimate",
          "tagline": "Furie incontrôlable",
          "tagline_en": "Unstoppable Fury",
          "description": "Le Berserker sacrifie sa propre survie pour des frappes d'une violence inouïe, plus dangereux à mesure qu'il saigne.",
          "description_en": "The Berserker sacrifices survival for strikes of unmatched violence, growing deadlier as he bleeds.",
          "lore": "Marqués par les Abysses, ces guerriers ont appris à transformer la douleur en puissance brute. Leur Souffle brûle plus vite, plus fort. Et ils le savent.",
          "lore_en": "Marked by the Abyss, these warriors learned to turn pain into raw power. Their Breath burns faster, harder. And they know it.",
          "fissure_relation": "Marked by the Abyss, channels pain into rage. The martial mirror of the Occultist",
          "souffle_usage": "Breath burns fast and hot, traded for raw power",
          "tier3": [
            {"id": "bloodrage", "identity": "Life steal bruiser + sustain through damage + stronger at low HP", "signature": "Crimson Harvest"},
            {"id": "frenzied", "identity": "Speed demon + multi-hit attacks + attack speed buffs", "signature": "Rampage"}
          ]
        },
        {
          "id": "weaponmaster",
          "name": "Weapon Master",
          "identity": "Technique melee + armor break + one big hit identity",
          "signature_skill": "titan_slam",
          "tagline": "Maître des armes",
          "tagline_en": "Master of Arms",
          "description": "Le Weapon Master s'adapte à chaque combat, exploitant la moindre ouverture avec une précision mortelle.",
          "description_en": "The Weapon Master adapts to every fight, exploiting any opening with deadly precision.",
          "lore": "Experts des écoles martiales disparues, les Weapon Masters incarnent la discipline et l'excellence au combat. Pas besoin des Fissures pour être dangereux.",
          "lore_en": "Experts of lost martial schools, Weapon Masters embody discipline and combat excellence. No Rifts needed to be lethal.",
          "fissure_relation": "Doesn't care about the Rifts. Pure technique, pure discipline",
          "souffle_usage": "Breath controlled through discipline, every strike measured",
          "tier3": [
            {"id": "hammer_lord", "identity": "Heavy weapon specialist + stun machine + armor crusher", "signature": "Seismic Slam"},
            {"id": "dual_axe_reaver", "identity": "Twin weapon specialist + bleed stacking + brutal multi-hit", "signature": "Execution"}
          ]
        },
        {
          "id": "warlord",
          "name": "Warlord",
          "identity": "Leader support + offensive buffs + controlled pressure",
          "signature_skill": "war_banner",
          "tagline": "Seigneur de guerre",
          "tagline_en": "War Lord",
          "description": "Le Warlord domine le champ de bataille par son autorité, renforçant ses alliés et brisant la volonté ennemie.",
          "description_en": "The Warlord dominates the battlefield through authority, empowering allies and breaking enemy will.",
          "lore": "Chefs de guerre et stratèges, les Warlords mènent leurs troupes comme une seule lame. Seuls, ils sont redoutables. Avec les leurs, ils sont invincibles.",
          "lore_en": "War chiefs and strategists, Warlords lead their troops as a single blade. Alone, they are formidable. With their own, they are unstoppable.",
          "fissure_relation": "Leads others through the crisis, forges the team into one",
          "souffle_usage": "Breath shared through command, strengthens those around him",
          "tier3": [
            {"id": "commander", "identity": "Team buffer + morale booster + strategic support", "signature": "Call to Glory"},
            {"id": "dreadlord", "identity": "Fear and intimidation + enemy debuffer + psychological warfare", "signature": "Reign of Terror"}
          ]
        }
      ]
    },
    {
      "id": "mage",
      "name": "Mage",
      "role": "dps_magic",
      "primary_stat": "mag",
      "identity": "Ranged magic damage + light control",
      "tagline": "Maître des arcanes",
      "tagline_en": "Master of Arcane",
      "description": "Le Mage canalise les forces arcanes pour infliger des dégâts dévastateurs à distance, contrôlant le champ de bataille par la magie.",
      "description_en": "The Mage channels arcane forces to inflict devastating damage from range, controlling the battlefield through magic.",
      "lore": "Les Mages canalisent leur Souffle à travers des forces que d'autres craignent. À la découverte des Fissures, chacun choisit son chemin : les éléments purs, les ténèbres de l'Abîme, la lecture des probabilités, ou la lame au poing.",
      "lore_en": "Mages channel their Breath through forces others fear. When the Rifts are discovered, each chooses their path: pure elements, the Abyss's darkness, probability reading, or blade in hand.",
      "difficulty": "medium",
      "recommended_for": ["casters", "aoe_damage", "control"],
      "wiki_intro": "Le Mage est le maître incontesté des dégâts magiques à distance. Capable de décimer des groupes entiers d'un seul sort ou de neutraliser une cible prioritaire, il représente une menace constante depuis l'arrière-garde. Ses spécialisations offrent des styles variés : l'Élémentaliste déchaîne les forces primaires, l'Occultist corrompt et affaiblit, le Cardmaster joue avec le destin, et le Spellblade ose s'aventurer au corps à corps. Fragile mais dévastateur, le Mage récompense les joueurs qui maîtrisent le positionnement et le timing.",
      "wiki_intro_en": "The Mage is the undisputed master of ranged magical damage. Capable of decimating entire groups with a single spell or neutralizing a priority target, they represent a constant threat from the backline. Their specializations offer varied playstyles: the Elementalist unleashes primal forces, the Occultist corrupts and weakens, the Cardmaster plays with fate, and the Spellblade dares venture into melee. Fragile but devastating, the Mage rewards players who master positioning and timing.",
      "playstyle_tips": ["Restez à distance et laissez le tank absorber l'aggro", "Ciblez les ennemis groupés pour maximiser vos AoE", "Gardez un sort de contrôle pour vous protéger"],
      "playstyle_tips_en": ["Stay at range and let the tank absorb aggro", "Target grouped enemies to maximize AoE", "Keep a control spell ready for self-protection"],
      "skills_file": "mage/skills.json",
      "passives_file": "mage/passives.json",
      "subclasses": [
        {
          "id": "elementalist",
          "name": "Elementalist",
          "identity": "Elemental damage + clear AoE shapes",
          "signature_skill": "elemental_burst",
          "tagline": "Maître des forces primaires",
          "tagline_en": "Master of Primal Forces",
          "description": "L'Élémentaliste canalise les forces naturelles du monde : feu, glace, foudre. Celles qui existaient avant les Fissures. Le chemin le plus sûr pour un mage.",
          "description_en": "The Elementalist channels the world's natural forces: fire, ice, lightning. Those that existed before the Rifts. The safest path for a mage.",
          "lore": "Là où d'autres mages plongent dans l'Abîme, les Élémentalistes puisent dans ce que le monde a toujours offert. Leur Souffle traverse les éléments les plus purs.",
          "lore_en": "Where other mages dive into the Abyss, Elementalists draw from what the world has always offered. Their Breath flows through the purest elements.",
          "fissure_relation": "Refuses the Rifts, channels natural forces that predate them",
          "souffle_usage": "Breath flows through natural elements, the purest path",
          "tier3": [
            {"id": "frostcaller", "identity": "Ice control + roots + safe AoE pressure", "signature": "Absolute Zero"},
            {"id": "stormweaver", "identity": "Lightning tempo + stuns + wide pressure", "signature": "Storm Overdrive"}
          ]
        },
        {
          "id": "occultist",
          "name": "Occultist",
          "identity": "Dark magic pressure + debuffs + disruptive control",
          "signature_skill": "shadow_pact",
          "tagline": "Semeur de corruption",
          "tagline_en": "Sower of Corruption",
          "description": "L'Occultist étudie les ténèbres des Fissures pour les comprendre et les retourner. Malédictions, drains, rituels interdits. Le chemin le plus risqué pour un mage.",
          "description_en": "The Occultist studies the Rifts' darkness to understand and turn it. Curses, drains, forbidden rituals. The riskiest path for a mage.",
          "lore": "Certains mages ont choisi d'étudier les Abysses plutôt que de les combattre. Leur Souffle traverse des forces que d'autres n'osent même pas nommer, marchant une ligne fine entre maîtrise et perdition.",
          "lore_en": "Some mages chose to study the Abyss rather than fight it. Their Breath passes through forces others dare not even name, walking a fine line between mastery and ruin.",
          "fissure_relation": "Studies the Rifts' darkness to understand them, the riskiest path",
          "souffle_usage": "Breath passes through Abyssal forces, risk of corruption",
          "tier3": [
            {"id": "sorcerer", "identity": "Pure arcane burst + silence + magic resist shred", "signature": "Arcane Cataclysm"},
            {"id": "summoner", "identity": "No-pet summoning: manifestations, fear and marks", "signature": "Eldritch Eruption"}
          ]
        },
        {
          "id": "cardmaster",
          "name": "Cardmaster",
          "identity": "Luck manipulation + flexible patterns + burst windows",
          "signature_skill": "fate_flip",
          "tagline": "Architecte du destin",
          "tagline_en": "Architect of Fate",
          "description": "Le Cardmaster lit les patterns de probabilité que les Fissures ont introduits dans le monde. Ses cartes arcanes redistribuent buffs et calamités. L'imprévisible du groupe.",
          "description_en": "The Cardmaster reads the probability patterns the Rifts introduced into the world. Their arcane cards redistribute buffs and calamities. The wildcard of any team.",
          "lore": "Quand les Fissures sont apparues, certains mages ont remarqué que le hasard lui-même avait changé. Ils ont développé des cartes arcanes pour lire et exploiter ces nouveaux patterns. Leur Souffle alimente une lecture constante des probabilités.",
          "lore_en": "When the Rifts appeared, some mages noticed that chance itself had changed. They developed arcane cards to read and exploit these new patterns. Their Breath fuels a constant reading of probabilities.",
          "fissure_relation": "Reads the probability patterns the Rifts introduced, the unpredictable path",
          "souffle_usage": "Breath fuels probability reading through arcane cards",
          "tier3": [
            {"id": "arcane_dealer", "identity": "Consistent combo DPS + crit windows + marked focus", "signature": "Royal Flush"},
            {"id": "fate_gambler", "identity": "High variance debuffs + luck manipulation + clutch plays", "signature": "All In"}
          ]
        },
        {
          "id": "spellblade",
          "name": "Spellblade",
          "identity": "Hybrid: melee magic + self buffs",
          "signature_skill": "arcane_cleave",
          "tagline": "Lame enchantée",
          "tagline_en": "Enchanted Blade",
          "description": "Le Spellblade n'a pas besoin de comprendre les Fissures pour les combattre. Il infuse son Souffle dans sa lame et son corps, et se bat en première ligne. Le chemin le plus courageux pour un mage.",
          "description_en": "The Spellblade doesn't need to understand the Rifts to fight them. They infuse their Breath into blade and body, and fight on the frontline. The bravest path for a mage.",
          "lore": "Formés dans des ordres martiaux arcanes, les Spellblades combattent là où la magie seule ne suffit pas. Leur Souffle coule dans leurs muscles et leur acier, pas dans des formules.",
          "lore_en": "Trained in arcane martial orders, Spellblades fight where magic alone falls short. Their Breath flows into muscle and steel, not formulas.",
          "fissure_relation": "Fights the Rifts directly in melee, doesn't need to understand them",
          "souffle_usage": "Breath infused into body and weapon, the most physical usage of magic",
          "tier3": [
            {"id": "battlemage", "identity": "Melee arcane bruiser + stuns + self shields", "signature": "Arcane Onslaught"},
            {"id": "runeknight", "identity": "Defensive arcane knight + wards + magic resist buffs", "signature": "Runic Judgment"}
          ]
        }
      ]
    },
    {
      "id": "healer",
      "name": "Healer",
      "role": "support_heal",
      "primary_stat": "mag",
      "identity": "Healing + cleansing + protection",
      "tagline": "Gardien des âmes",
      "tagline_en": "Guardian of Souls",
      "description": "Le Healer maintient son équipe en vie, soignant les blessures et dissipant les malédictions.",
      "description_en": "The Healer keeps the team alive, healing wounds and dispelling curses.",
      "lore": "Les Healers canalisent leur Souffle pour préserver la vie face aux horreurs des Fissures. Qu'ils soignent par la nature, la lumière, la voix ou le sacrifice, leur but est le même : que personne ne tombe.",
      "lore_en": "Healers channel their Breath to preserve life against the horrors of the Rifts. Whether they heal through nature, light, voice or sacrifice, their goal is the same: no one falls.",
      "difficulty": "hard",
      "recommended_for": ["support", "healers", "team_players"],
      "wiki_intro": "Le Healer est le pilier invisible de toute équipe. Sans lui, même les guerriers les plus robustes finissent par tomber. Cette classe demande une excellente conscience de la situation : surveiller les barres de vie, anticiper les dégâts, et savoir quand purifier un debuff critique. Le Lifewarden régénère patiemment, le Lightbringer soigne en urgence, le Chantre peut même ressusciter les alliés tombés au combat, et le Martyr sacrifie sa propre vitalité pour protéger ses alliés. Jouer Healer, c'est accepter que la victoire de l'équipe passe avant votre gloire personnelle.",
      "wiki_intro_en": "The Healer is the invisible pillar of any team. Without them, even the sturdiest warriors eventually fall. This class demands excellent situational awareness: monitoring health bars, anticipating damage, and knowing when to purify a critical debuff. The Lifewarden patiently regenerates, the Lightbringer heals urgently, the Cantor can even resurrect the fallen, and the Martyr sacrifices their own vitality to protect allies. Playing Healer means accepting that team victory comes before personal glory.",
      "playstyle_tips": ["Surveillez les barres de vie de toute l'équipe", "Gardez vos gros soins pour les situations critiques", "Purifiez les debuffs dangereux en priorité"],
      "playstyle_tips_en": ["Monitor the entire team's health bars", "Save big heals for critical situations", "Prioritize cleansing dangerous debuffs"],
      "skills_file": "healer/skills.json",
      "passives_file": "healer/passives.json",
      "subclasses": [
        {
          "id": "lifewarden",
          "name": "Lifewarden",
          "identity": "Sustain + regen + light defensive AoE",
          "signature_skill": "nature_blessing",
          "tagline": "Gardien de la vie",
          "tagline_en": "Guardian of Life",
          "description": "Le Lifewarden soigne par la nature elle-même, régénérant lentement mais sûrement ses alliés.",
          "description_en": "The Lifewarden heals through nature itself, slowly but surely regenerating allies.",
          "lore": "Liés aux forces vitales du monde, les Lifewardens soignent par ce qui existait avant les Fissures. Leur Souffle passe par la nature, lent et patient.",
          "lore_en": "Bound to the world's vital forces, Lifewardens heal through what existed before the Rifts. Their Breath passes through nature, slow and patient.",
          "fissure_relation": "Heals through natural forces that predate the Rifts",
          "souffle_usage": "Breath flows through nature, patient and organic",
          "tier3": [
            {"id": "druidic_healer", "identity": "Ancient regen + protective nature wards", "signature": "Worldheart Bloom"},
            {"id": "grove_warden", "identity": "Nature shields + thorns + protective auras", "signature": "Living Fortress"}
          ]
        },
        {
          "id": "lightbringer",
          "name": "Lightbringer",
          "identity": "Burst heals + holy buffs",
          "signature_skill": "heal_burst",
          "tagline": "Flambeau sacré",
          "tagline_en": "Sacred Beacon",
          "description": "Le Lightbringer concentre son Souffle en un instant pour des soins massifs et une lumière purificatrice.",
          "description_en": "The Lightbringer concentrates their Breath in an instant for massive heals and purifying light.",
          "lore": "Quand les Fissures frappent et que les alliés tombent, les Lightbringers répondent. Leur Souffle se concentre en un instant, brut et immédiat.",
          "lore_en": "When the Rifts strike and allies fall, Lightbringers answer. Their Breath concentrates in an instant, raw and immediate.",
          "fissure_relation": "Direct response to the Rifts, concentrated healing in moments of crisis",
          "souffle_usage": "Breath concentrated in a flash, raw and immediate",
          "tier3": [
            {"id": "sanctifier", "identity": "Cleanse specialist + anti-curse protection", "signature": "Exorcism"},
            {"id": "battle_healer", "identity": "Frontline healer + shields + holy strikes", "signature": "Radiant Judgment"}
          ]
        },
        {
          "id": "cantor",
          "name": "Cantor",
          "identity": "Sacred hymns + resurrection + holy purification",
          "signature_skill": "requiem",
          "tagline": "Voix sacrée",
          "tagline_en": "Sacred Voice",
          "description": "Le Chantre chante des hymnes anciens qui soignent, purifient et peuvent même ramener les alliés tombés.",
          "description_en": "The Cantor sings ancient hymns that heal, purify and can even bring back fallen allies.",
          "lore": "Seuls les Chantres connaissent les paroles anciennes capables de rappeler une âme du seuil de la mort. Leur Souffle passe par leur voix, et les mots façonnent l'effet.",
          "lore_en": "Only Cantors know the ancient words able to recall a soul from death's threshold. Their Breath passes through their voice, and the words shape the effect.",
          "fissure_relation": "Preserves ancient words and hymns from before the Rifts",
          "souffle_usage": "Breath channeled through the voice, words shape the effect",
          "tier3": [
            {"id": "exorcist", "identity": "Anti-undead specialist + purification + banish debuffs", "signature": "Divine Judgment"},
            {"id": "choirmaster", "identity": "Mass resurrection + team-wide sacred protection", "signature": "Chorus of Salvation"}
          ]
        },
        {
          "id": "martyr",
          "name": "Martyr",
          "identity": "Self-sacrifice + lifesteal + protective healing",
          "signature_skill": "offering",
          "tagline": "Bouclier vivant",
          "tagline_en": "Living Shield",
          "description": "Le Martyr donne de sa propre vie pour protéger ses alliés, s'interposant entre eux et le danger et trouvant la restauration dans son sacrifice.",
          "description_en": "The Martyr gives their own life to protect allies, standing between them and danger, finding restoration through sacrifice.",
          "lore": "Ces guérisseurs ont compris qu'il n'y a pas de plus grand amour que de donner sa vie pour ceux qu'on protège. Leur Souffle se consume pour que celui des autres ne s'éteigne pas.",
          "lore_en": "These healers understood that there is no greater love than to give one's life for those you protect. Their Breath is consumed so that others' may endure.",
          "fissure_relation": "Stands between allies and the Rifts, pays the price personally",
          "souffle_usage": "Breath consumed through self-sacrifice, restoration through giving",
          "tier3": [
            {"id": "intercessor", "identity": "Sacrifice specialist + self-sustain + restorative counter-attacks", "signature": "Redemptive Strike"},
            {"id": "covenant", "identity": "Life link + sacrifice healing + protective shields", "signature": "Sacred Pact"}
          ]
        }
      ]
    },
    {
      "id": "archer",
      "name": "Archer",
      "role": "dps_ranged",
      "primary_stat": "atk",
      "identity": "Ranged physical DPS + terrain-style control via patterns + marked focus",
      "tagline": "Œil infaillible",
      "tagline_en": "Unerring Eye",
      "description": "L'Archer frappe de loin avec précision, marquant ses cibles et contrôlant le terrain par ses tirs.",
      "description_en": "The Archer strikes from afar with precision, marking targets and controlling terrain through shots.",
      "lore": "Chasseurs des terres sauvages, les Archers ont appris à survivre là où nul autre n'ose s'aventurer. Leur Souffle, c'est leur concentration, leur instinct. Ce qui fait que la flèche trouve toujours sa cible.",
      "lore_en": "Hunters of the wilds, Archers learned to survive where no one else dares venture. Their Breath is their focus, their instinct. What makes the arrow always find its mark.",
      "difficulty": "medium",
      "recommended_for": ["dps", "ranged", "precision"],
      "wiki_intro": "L'Archer combine distance de sécurité et dégâts physiques constants. Contrairement au Mage qui mise sur de gros pics de dégâts, l'Archer maintient une pression soutenue tout au long du combat. Le système de marquage lui permet de concentrer le feu de l'équipe sur une cible prioritaire. Le Ranger offre une fiabilité classique, le Falconer synchronise ses frappes avec son faucon, le Ball Master crée le chaos avec des projectiles rebondissants, et le Gunslinger déclenche des rafales dévastatrices. L'Archer récompense les joueurs qui aiment le contrôle et la précision.",
      "wiki_intro_en": "The Archer combines safe distance with constant physical damage. Unlike the Mage who relies on big damage spikes, the Archer maintains sustained pressure throughout combat. The marking system allows focusing team fire on priority targets. The Ranger offers classic reliability, the Falconer synchronizes strikes with their falcon, the Ball Master creates chaos with bouncing projectiles, and the Gunslinger unleashes devastating bursts. The Archer rewards players who enjoy control and precision.",
      "playstyle_tips": ["Marquez les cibles prioritaires pour concentrer le feu", "Maintenez une distance sécuritaire", "Utilisez vos patterns pour contrôler le terrain"],
      "playstyle_tips_en": ["Mark priority targets to focus fire", "Maintain safe distance", "Use patterns to control terrain"],
      "skills_file": "archer/skills.json",
      "passives_file": "archer/passives.json",
      "subclasses": [
        {
          "id": "ranger",
          "name": "Ranger",
          "identity": "Classic archer + reliable DPS + critical strikes + versatile shots",
          "signature_skill": "headshot",
          "tagline": "Tireur implacable",
          "tagline_en": "Relentless Marksman",
          "description": "Le Ranger excelle dans un tir constant et précis, usant l'ennemi sans relâche.",
          "description_en": "The Ranger excels at constant, precise shooting, wearing down enemies relentlessly.",
          "lore": "Les Rangers étaient déjà mortels avant les Fissures. Leur Souffle est leur patience, chaque tir mesuré, chaque flèche comptée.",
          "lore_en": "Rangers were already lethal before the Rifts. Their Breath is their patience, every shot measured, every arrow counted.",
          "fissure_relation": "Was lethal before the Rifts, will be after. Pure skill",
          "souffle_usage": "Breath is focus and patience, every shot measured",
          "tier3": [
            {"id": "sharpshooter", "identity": "Critical strike specialist + precision damage + high burst windows", "signature": "Kill Shot"},
            {"id": "skirmisher", "identity": "Mobile archer + hit & run + evasion + sustained pressure", "signature": "Guerrilla Assault"}
          ]
        },
        {
          "id": "falconer",
          "name": "Falconer",
          "identity": "Burst windows via companion strikes (no persistent summon unit)",
          "signature_skill": "falcon_assault",
          "tagline": "Chasseur synchronisé",
          "tagline_en": "Synchronized Hunter",
          "description": "Le Falconer combat aux côtés de son faucon, marquant et harcelant l'ennemi sans répit.",
          "description_en": "The Falconer fights alongside their falcon, marking and harassing enemies without respite.",
          "lore": "Un lien ancestral unit ces archers à leurs compagnons ailés. Leur Souffle se partage entre le chasseur et le faucon, un instinct synchronisé que rien ne peut briser.",
          "lore_en": "An ancestral bond unites these archers with their winged companions. Their Breath is shared between hunter and falcon, a synchronized instinct nothing can break.",
          "fissure_relation": "The bond with the falcon predates the Rifts and outlasts them",
          "souffle_usage": "Breath shared between archer and falcon, synchronized instinct",
          "tier3": [
            {"id": "falcon_striker", "identity": "Perfect sync + maximum burst + coordinated dive attacks", "signature": "Synchronized Kill"},
            {"id": "wind_hunter", "identity": "Hit & run + evasion + constant harass + aerial mobility", "signature": "Aerial Dominance"}
          ]
        },
        {
          "id": "ballmaster",
          "name": "Ballmaster",
          "identity": "Special projectiles + bouncing attacks + trick shots + creative damage",
          "signature_skill": "hunters_cage",
          "tagline": "Virtuose du rebond",
          "tagline_en": "Ricochet Virtuoso",
          "description": "Le Ball Master projette des attaques imprévisibles qui ricochent et frappent plusieurs cibles.",
          "description_en": "The Ball Master launches unpredictable attacks that ricochet and hit multiple targets.",
          "lore": "Personne ne les a pris au sérieux jusqu'au premier combat. Un ballon, des angles, et assez de Souffle pour que chaque rebond frappe plus fort que le précédent.",
          "lore_en": "Nobody took them seriously until the first fight. A ball, angles, and enough Breath to make each bounce hit harder than the last.",
          "fissure_relation": "Turns any battlefield into a playground, Rifts or not",
          "souffle_usage": "Breath fuels creativity and trick shots, unpredictable rhythm",
          "tier3": [
            {"id": "bouncer", "identity": "Ricocheting projectiles + multi-target chains + spreading damage", "signature": "Pinball Fury"},
            {"id": "striker", "identity": "Rapid combos + trick shots + speed burst + multi-hit", "signature": "Ultimate Combo"}
          ]
        },
        {
          "id": "gunslinger",
          "name": "Gunslinger",
          "identity": "Rapid fire specialist + quick draw + burst shots + speed demon",
          "signature_skill": "pin_down",
          "tagline": "As du tir rapide",
          "tagline_en": "Rapid Fire Ace",
          "description": "Le Gunslinger déchaîne des rafales dévastatrices avant de devoir recharger.",
          "description_en": "The Gunslinger unleashes devastating bursts before needing to reload.",
          "lore": "Issus des avancées technologiques récentes, les Gunslingers manient des armes à feu expérimentales que peu comprennent. Leur Souffle est pur réflexe, des rafales courtes et précises.",
          "lore_en": "Born from recent technological advances, Gunslingers wield experimental firearms that few understand. Their Breath is pure reflex, short and precise bursts.",
          "fissure_relation": "Adopted new weapons to face new threats, adapts faster than anyone",
          "souffle_usage": "Breath is speed and reflexes, burst rhythm",
          "tier3": [
            {"id": "quickshot", "identity": "Rapid fire bursts + speed buffs + multi-shot specialist", "signature": "Bullet Storm"},
            {"id": "deadeye", "identity": "Extreme precision + execution shots + crit windows + finisher specialist", "signature": "Headshot"}
          ]
        }
      ]
    },
    {
      "id": "rogue",
      "name": "Rogue",
      "role": "dps_melee",
      "primary_stat": "atk",
      "identity": "Single-target physical DPS + debuffs + target control (burst windows)",
      "tagline": "Ombre mortelle",
      "tagline_en": "Deadly Shadow",
      "description": "Le Rogue frappe depuis les ombres, éliminant les cibles prioritaires avec une précision chirurgicale.",
      "description_en": "The Rogue strikes from shadows, eliminating priority targets with surgical precision.",
      "lore": "Formés dans l'ombre, les Rogues frappent là où personne ne regarde. Leur Souffle, c'est leur instinct, cette capacité à sentir la faille avant qu'elle n'apparaisse.",
      "lore_en": "Trained in shadow, Rogues strike where no one is looking. Their Breath is their instinct, the ability to sense the opening before it appears.",
      "difficulty": "hard",
      "recommended_for": ["assassins", "burst_damage", "advanced"],
      "wiki_intro": "Le Rogue est l'exécuteur ultime. Là où le Guerrier tient la ligne et le Mage frappe de loin, le Rogue contourne les défenses pour éliminer les cibles critiques : healers ennemis, mages dévastateurs, ou boss affaiblis. C'est une classe à haut risque et haute récompense qui demande une excellente lecture du combat. Le Shadowblade assassine depuis les ombres, le Trickster sème la confusion, le Corsair combine lame et pistolet, et le Duelist maîtrise l'art de la riposte. Jouer Rogue, c'est accepter d'être fragile pour frapper plus fort.",
      "wiki_intro_en": "The Rogue is the ultimate executioner. Where the Warrior holds the line and the Mage strikes from afar, the Rogue bypasses defenses to eliminate critical targets: enemy healers, devastating mages, or weakened bosses. It's a high-risk, high-reward class that demands excellent combat reading. The Shadowblade assassinates from shadows, the Trickster sows confusion, the Corsair combines blade and pistol, and the Duelist masters the art of riposte. Playing Rogue means accepting fragility to strike harder.",
      "playstyle_tips": ["Attendez le bon moment pour frapper", "Ciblez les healers et mages ennemis", "Utilisez vos esquives pour survivre"],
      "playstyle_tips_en": ["Wait for the right moment to strike", "Target enemy healers and mages", "Use evasion abilities to survive"],
      "skills_file": "rogue/skills.json",
      "passives_file": "rogue/passives.json",
      "subclasses": [
        {
          "id": "shadowblade",
          "name": "Shadowblade",
          "identity": "Extreme single-target burst + stealth assassination + execution",
          "signature_skill": "death_blossom",
          "tagline": "Frappe de l'ombre",
          "tagline_en": "Shadow Strike",
          "description": "Le Shadowblade élimine les cibles vulnérables en contournant les lignes ennemies.",
          "description_en": "The Shadowblade eliminates vulnerable targets by bypassing enemy lines.",
          "lore": "Plus les Fissures s'étendent, plus les ombres grandissent. Leur Souffle se retient, se contrôle, se libère en une seule frappe fatale.",
          "lore_en": "The more the Rifts spread, the more shadows grow. Their Breath is held, controlled, released in one fatal strike.",
          "fissure_relation": "Uses the shadows the Rifts cast. More darkness, more places to hide",
          "souffle_usage": "Breath held, controlled, released in one fatal strike",
          "tier3": [
            {"id": "nightstalker", "identity": "Stealth windows + anti-caster assassination", "signature": "Final Cut"},
            {"id": "assassin", "identity": "Execution bursts + bleed stacking + finisher specialist", "signature": "Guillotine"}
          ]
        },
        {
          "id": "trickster",
          "name": "Trickster",
          "identity": "Disruption + misdirection + soft control (team play)",
          "signature_skill": "grand_swindle",
          "tagline": "Maître de l'illusion",
          "tagline_en": "Master of Illusion",
          "description": "Le Trickster sème le chaos en brouillant les priorités et la perception ennemie.",
          "description_en": "The Trickster sows chaos by scrambling enemy priorities and perception.",
          "lore": "Pour eux, le combat est un jeu de dupes où l'esprit compte plus que la lame. Leur Souffle sert à tromper, pas à frapper.",
          "lore_en": "For them, combat is a game of deception where wit matters more than blade. Their Breath is spent on misdirection, not brute force.",
          "fissure_relation": "Doesn't fight the Rifts directly, manipulates everyone else into doing it",
          "souffle_usage": "Breath spent on misdirection and control, not brute force",
          "tier3": [
            {"id": "debuffer", "identity": "Crippling debuffs + team utility + weakening specialist", "signature": "Total Shutdown"},
            {"id": "blinker", "identity": "Teleportation + hit & run + untargetable windows + evasion master", "signature": "Dimensional Assault"}
          ]
        },
        {
          "id": "corsair",
          "name": "Corsair",
          "identity": "Pirate agility + hybrid melee/ranged + dirty tricks + swashbuckler",
          "signature_skill": "venom_burst",
          "tagline": "Lame des flots",
          "tagline_en": "Blade of the Tides",
          "description": "Le Corsair taillade les rangs adverses par des attaques en balayage et des saignements cumulés.",
          "description_en": "The Corsair slashes through enemy ranks with sweeping attacks and stacking bleeds.",
          "lore": "Pirates et mercenaires, les Corsairs vivent pour le risque et la liberté. Leur Souffle se dépense sans compter, et se vole sur l'ennemi.",
          "lore_en": "Pirates and mercenaries, Corsairs live for risk and freedom. Their Breath is spent recklessly, and stolen back from enemies.",
          "fissure_relation": "The Rifts opened new routes, new dangers, new treasures. Perfect.",
          "souffle_usage": "Breath reckless, spent freely, stolen back from enemies",
          "tier3": [
            {"id": "cutthroat", "identity": "Aggressive melee pirate + bleed + dirty fighting + burst DPS", "signature": "Run Through"},
            {"id": "gunslasher", "identity": "Hybrid melee/ranged + pistol + sword combo + versatile fighter", "signature": "Broadside"}
          ]
        },
        {
          "id": "duelist",
          "name": "Duelist",
          "identity": "Fast melee skirmisher + reliable line pressure",
          "signature_skill": "flurry_finisher",
          "tagline": "Maître du contre",
          "tagline_en": "Master of Counter",
          "description": "Le Duelist excelle dans l'art de la riposte, retournant la force ennemie contre elle-même.",
          "description_en": "The Duelist excels at riposte, turning enemy strength against itself.",
          "lore": "Élevés dans les traditions du duel, technique et sang-froid avant tout. Leur Souffle est leur calme, la patience d'attendre le moment parfait pour riposter.",
          "lore_en": "Raised in dueling traditions, technique and composure above all. Their Breath is their calm, the patience to wait for the perfect moment to strike back.",
          "fissure_relation": "The Rifts changed nothing about the art of the duel",
          "souffle_usage": "Breath is composure, patience, the perfect moment to counter",
          "tier3": [
            {"id": "blade_dancer", "identity": "Multi-hit combos + crit stacking + flowing attacks", "signature": "Blade Storm"},
            {"id": "countermaster", "identity": "Defensive stance + riposte damage + punish attackers", "signature": "Perfect Counter"}
          ]
        }
      ]
    },
    {
      "id": "artisan",
      "name": "Artisan",
      "role": "support_utility",
      "primary_stat": "atk",
      "identity": "Craft-based support + debuff setup + signature finishers",
      "tagline": "Maître des métiers",
      "tagline_en": "Master of Crafts",
      "description": "L'Artisan apporte un soutien unique via ses métiers, préparant des ouvertures pour son équipe et finissant les cibles affaiblies.",
      "description_en": "The Artisan provides unique support through crafts, setting up openings for the team and finishing weakened targets.",
      "lore": "Ces maîtres artisans ont transformé leurs savoirs ancestraux en armes de guerre. Leur Souffle passe par leurs mains, leurs outils, leurs créations.",
      "lore_en": "These master craftsmen turned ancestral knowledge into weapons of war. Their Breath flows through their hands, their tools, their creations.",
      "difficulty": "medium",
      "recommended_for": ["utility", "team_synergy", "creative"],
      "wiki_intro": "L'Artisan est la classe la plus originale de Kanarion Online. Plutôt que de simplement infliger des dégâts ou soigner, il prépare le terrain pour son équipe. Ses debuffs créent des fenêtres de vulnérabilité, ses buffs renforcent les alliés au moment critique, et ses finishers punissent les ennemis affaiblis. Le Blacksmith brise les armures, l'Alchemist empoisonne et fait détoner, le Chef nourrit et galvanise, et le Musician contrôle le tempo du combat. L'Artisan brille en synergie avec son équipe et récompense les joueurs créatifs.",
      "wiki_intro_en": "The Artisan is Kanarion Online's most original class. Rather than simply dealing damage or healing, they prepare the battlefield for their team. Their debuffs create vulnerability windows, their buffs empower allies at critical moments, and their finishers punish weakened enemies. The Blacksmith breaks armor, the Alchemist poisons and detonates, the Chef feeds and galvanizes, and the Musician controls combat tempo. The Artisan shines in team synergy and rewards creative players.",
      "playstyle_tips": ["Préparez le terrain avec vos debuffs", "Coordonnez vos finishers avec les burst de l'équipe", "Adaptez votre métier à la composition"],
      "playstyle_tips_en": ["Prepare the field with your debuffs", "Coordinate finishers with team bursts", "Adapt your craft to team composition"],
      "skills_file": "artisan/skills.json",
      "passives_file": "artisan/passives.json",
      "subclasses": [
        {
          "id": "blacksmith",
          "name": "Blacksmith",
          "identity": "Armor breaking + boss setup + brutal finisher",
          "signature_skill": "anvil_crash",
          "tagline": "Briseur d'armures",
          "tagline_en": "Armor Breaker",
          "description": "Le Blacksmith frappe dur et brise les défenses ennemies pour préparer des fenêtres de burst dévastatrices.",
          "description_en": "The Blacksmith hits hard and breaks enemy defenses to set up devastating burst windows.",
          "lore": "Forgerons de guerre, ils ont appris à détruire ce qu'ils savaient créer. Leur Souffle passe par le marteau, chaque frappe façonne ou brise.",
          "lore_en": "War smiths, they learned to destroy what they knew how to create. Their Breath flows through the hammer, every strike shapes or shatters.",
          "fissure_relation": "The Rifts break things. The Blacksmith knows how to break too, and rebuild",
          "souffle_usage": "Breath flows through hammer and anvil, shaping or shattering",
          "tier3": [
            {"id": "forgemaster", "identity": "Protective forging + shields + anti-CC anchor", "signature": "Living Fortress"},
            {"id": "breaker", "identity": "Anti-boss breaker + brutal vulnerability windows", "signature": "Shatterpoint"}
          ]
        },
        {
          "id": "alchemist",
          "name": "Alchemist",
          "identity": "Debuff pressure + DoT setup + reaction bursts",
          "signature_skill": "catalyze",
          "tagline": "Maître des réactions",
          "tagline_en": "Master of Reactions",
          "description": "L'Alchemist empoisonne et affaiblit ses ennemis, préparant des détonations chimiques dévastatrices.",
          "description_en": "The Alchemist poisons and weakens enemies, setting up devastating chemical detonations.",
          "lore": "Ces savants ont découvert que les potions les plus mortelles ne sont pas destinées à être bues. Leur Souffle se distille en réactions chimiques.",
          "lore_en": "These scholars discovered that the deadliest potions aren't meant to be drunk. Their Breath is distilled into chemical reactions.",
          "fissure_relation": "Studies the Rifts with flasks and formulas, like any other phenomenon",
          "souffle_usage": "Breath distilled into potions and reactions, precise and calculated",
          "tier3": [
            {"id": "plague_brewer", "identity": "DoT stacking + soft control + attrition wins", "signature": "Plagueburst"},
            {"id": "reactionist", "identity": "Detonation windows + conditional burst + chain reactions", "signature": "Chain Reaction"}
          ]
        },
        {
          "id": "chef",
          "name": "Chef",
          "identity": "Sustain + tempo + clutch team utilities",
          "signature_skill": "shared_feast",
          "tagline": "Nourricier de l'équipe",
          "tagline_en": "Team Provider",
          "description": "Le Chef maintient son équipe en forme grâce à des plats revigorants et des buffs de tempo.",
          "description_en": "The Chef keeps the team in shape with invigorating dishes and tempo buffs.",
          "lore": "Un bon repas peut gagner une bataille. Ces chefs l'ont prouvé mille fois. Leur Souffle passe dans chaque plat qu'ils préparent pour les leurs.",
          "lore_en": "A good meal can win a battle. These chefs proved it a thousand times. Their Breath goes into every dish they prepare for their own.",
          "fissure_relation": "Doesn't fight the Rifts. Feeds those who do",
          "souffle_usage": "Breath poured into food that heals and strengthens, the most generous usage",
          "tier3": [
            {"id": "battle_cook", "identity": "Premium group support + tempo spikes", "signature": "Banquet Timing"},
            {"id": "spice_master", "identity": "Aggressive support (burn + vulnerability) + pressure finisher", "signature": "Inferno Seasoning"}
          ]
        },
        {
          "id": "musician",
          "name": "Musician",
          "identity": "Tempo control + clean buffs + team stability",
          "signature_skill": "grand_performance",
          "tagline": "Maître du tempo",
          "tagline_en": "Master of Tempo",
          "description": "Le Musician inspire et protège par ses mélodies, contrôlant le rythme du combat.",
          "description_en": "The Musician inspires and protects through melodies, controlling the rhythm of combat.",
          "lore": "Pour eux, chaque bataille est une symphonie dont ils sont le chef d'orchestre. Leur Souffle devient musique, et la musique contrôle le tempo.",
          "lore_en": "For them, every battle is a symphony they conduct. Their Breath becomes music, and the music controls the tempo.",
          "fissure_relation": "Brings the world back into tune when it falls apart",
          "souffle_usage": "Breath becomes music, controls the battlefield tempo",
          "tier3": [
            {"id": "bard", "identity": "Classic support anchor + anti-CC team window", "signature": "Perfect Harmony"},
            {"id": "drummer", "identity": "DPS pressure + mark windows + signature slam", "signature": "Drum Assault"}
          ]
        }
      ]
    }
  ],

  "_summary": {
    "classes_by_role": {
      "tank_melee": ["warrior"],
      "dps_melee": ["rogue"],
      "dps_ranged": ["archer"],
      "dps_magic": ["mage"],
      "support_heal": ["healer"],
      "support_utility": ["artisan"]
    },
    "subclasses_count": {
      "warrior": 4,
      "mage": 4,
      "healer": 4,
      "archer": 4,
      "rogue": 4,
      "artisan": 4
    }
  }
}
