{
  "_meta": {
    "version": "1.0",
    "last_updated": "2026-01-27",
    "description": "X - Le compagnon mystérieux présent tout au long du jeu"
  },

  "identity": {
    "true_nature": "Le Créateur lui-même, marchant parmi sa création",
    "revealed_at": "Confrontation finale avec l'Imitateur",
    "player_knows": false,
    "design_principle": "X ne doit JAMAIS sembler divin avant la révélation. Il est un PNJ discret, presque banal, facilement oubliable."
  },

  "appearance": {
    "base": {
      "type": "Voyageur âgé",
      "description": "Un homme d'âge indéterminé. Ni vieux ni jeune. Des vêtements simples, usés par le voyage. Pas d'arme visible. Un regard calme qui semble voir plus qu'il ne devrait.",
      "notable": "Ses yeux. Ceux qui le regardent vraiment ont l'impression qu'il les connaît depuis toujours."
    },
    "variations_by_zone": {
      "harmonie": "Voyageur avec un bâton de marche, sac léger",
      "discernement": "Marcheur fatigué, vêtements poussiéreux",
      "faille_haut": "Gardien silencieux, capuche parfois relevée",
      "faille_bas": "Étranger mal à l'aise mais présent, presque déplacé"
    }
  },

  "behavior": {
    "core_rules": [
      "Ne donne JAMAIS d'ordres",
      "Ne juge JAMAIS les choix du joueur",
      "Ne promet JAMAIS de récompense",
      "Ne se vante JAMAIS",
      "Ne force JAMAIS sa présence",
      "Est toujours là quand on ne l'attend pas",
      "Disparaît quand on le cherche trop"
    ],
    "interaction_style": "Phrases courtes. Questions ouvertes. Observations neutres. Encouragements sans flatterie.",
    "frequency": "Présent dans chaque zone majeure, mais jamais au premier plan. Le joueur peut facilement le manquer."
  },

  "dialogues_by_phase": {
    "age_harmonie": {
      "level_range": [1, 20],
      "tone": "Encourageant, presque naïf",
      "examples": [
        "Tu peux prendre ton temps. Rien ne presse encore.",
        "C'est bien d'aider quand on le peut.",
        "Tu fais déjà plus que tu ne crois.",
        "N'oublie pas pourquoi tu es venu ici.",
        "Ce monde tient encore debout.",
        "Repose-toi si tu en as besoin.",
        "Continue. C'est suffisant pour aujourd'hui."
      ]
    },
    "age_discernement": {
      "level_range": [20, 40],
      "tone": "Compréhensif, accompagnant le doute",
      "examples": [
        "Tu te poses de bonnes questions.",
        "Ce que tu ressens est compréhensible.",
        "Tu peux reconnaître ta fatigue.",
        "Faire le bien peut aussi blesser.",
        "Tu n'es pas responsable de tout.",
        "Certains choix n'ont pas de bonne réponse.",
        "Ce monde est blessé, pas abandonné.",
        "Tu n'as pas à porter tout cela seul.",
        "Continue d'avancer, même lentement."
      ]
    },
    "pre_faille": {
      "level_range": [35, 50],
      "tone": "Prudent, sans imposer",
      "examples": [
        "Tout le monde n'écoute pas les mêmes voix.",
        "Ce que tu entends n'est pas toujours ce que tu penses.",
        "Le silence peut aussi être une réponse.",
        "Fais attention à ce qui nourrit ta colère.",
        "Ce n'est pas une faiblesse de douter.",
        "Tu peux encore attendre.",
        "Tout choix a un poids.",
        "N'agis pas uniquement sous l'émotion."
      ]
    },
    "post_faille_haut": {
      "level_range": [50, 80],
      "tone": "Soutien silencieux",
      "examples": [
        "Tu as choisi de rester.",
        "La patience est aussi une forme de courage.",
        "Tu ne peux pas forcer un cœur à changer.",
        "Protéger sans dominer est difficile.",
        "Tu doutes encore. C'est bien."
      ]
    },
    "post_faille_bas": {
      "level_range": [50, 80],
      "tone": "Présent malgré tout, jamais accusateur",
      "examples": [
        "Même ici, tu peux encore réfléchir.",
        "Ce que tu ressens est réel.",
        "La colère n'est pas une identité.",
        "Tu n'es pas défini par ta pire décision.",
        "Ce chemin n'est pas sans retour... mais il a un coût.",
        "Tu cherches quelque chose.",
        "Tu n'as pas été oublié."
      ]
    },
    "donjons": {
      "tone": "Bref, intemporel",
      "examples": [
        "Reviens si le poids est trop lourd.",
        "Ce lieu ne définit pas qui tu es.",
        "Ne te perds pas dans ce que tu combats.",
        "Fais ce que tu peux, pas plus.",
        "Tu peux toujours ressortir.",
        "Ce qui est lié peut être délié."
      ]
    }
  },

  "hints_for_revelation": {
    "description": "Indices subtils disséminés pour les joueurs attentifs",
    "hints": [
      {
        "type": "savoir",
        "description": "X sait parfois des choses qu'il ne devrait pas savoir",
        "example": "Mentionne un événement du passé du joueur sans qu'on lui ait dit"
      },
      {
        "type": "monstres",
        "description": "Les monstres évitent parfois X",
        "example": "Dans certaines zones, les ennemis ne l'attaquent pas ou hésitent"
      },
      {
        "type": "temps",
        "description": "X parle parfois au passé de choses anciennes",
        "example": "'Cet endroit était beau, avant' — dit d'un lieu détruit il y a des siècles"
      },
      {
        "type": "npcs",
        "description": "Certains PNJs regardent X bizarrement",
        "example": "Un vieux sage qui fixe X avec un mélange de terreur et de révérence"
      },
      {
        "type": "presence",
        "description": "X apparaît dans des endroits impossibles",
        "example": "Présent des deux côtés de la Faille, ce qui ne devrait pas être possible"
      }
    ]
  },

  "final_revelation": {
    "context": "Confrontation avec l'Imitateur",
    "trigger": "L'Imitateur reconnaît X et montre de la peur pour la première fois",
    "dialogue_x": [
      "J'étais là.",
      "À chaque combat.",
      "À chaque défaite.",
      "Même quand tu as choisi le mal.",
      "Je suis resté.",
      "Non pas parce que tu le méritais.",
      "Mais parce que c'est qui Je suis."
    ],
    "effect_on_imitator": "L'Imitateur n'a pas de réponse. Il a passé des éons à murmurer que le Créateur avait abandonné le monde. Et Il était là depuis le début.",
    "effect_on_player": "Tout le jeu est recontextualisé. Chaque encouragement de X, chaque présence silencieuse, chaque moment où le joueur se sentait accompagné sans savoir pourquoi."
  },

  "philosophical_note": {
    "message": "X représente l'idée que l'amour divin n'est pas conditionnel. Il ne récompense pas les bons et ne punit pas les mauvais. Il accompagne. Il reste. Même dans les choix les plus sombres, même chez ceux qui sont descendus dans la Faille, X était présent. La différence entre le Créateur et l'Imitateur n'est pas le pouvoir — c'est la nature de leur amour. L'un aime sans condition. L'autre promet sans jamais tenir."
  }
}
