{
  "_meta": {
    "version": "1.0",
    "last_updated": "2026-01-27",
    "description": "Personnages majeurs — historiques et contemporains"
  },

  "historical_figures": {
    "era_harmony": [
      {
        "name": "Kayin de Nod",
        "title": "Le Premier Corrompu",
        "era": "Tekufat HaShalom (an 923)",
        "description": "Forgeron brillant qui fut le premier à entendre les murmures de Tzel'el. Il ne voulait pas le mal — il voulait créer quelque chose de nouveau. Tzel'el lui promit les secrets de la création.",
        "fate": "Devint le maître d'œuvre de Migdal. Mourut en prononçant les paroles du rituel de la Tentative.",
        "legacy": "Les forgerons évitent de prononcer son nom. Ses outils existent encore — maudits.",
        "twist_potential": "Sa lignée survit. L'un de ses descendants est un PNJ important."
      },
      {
        "name": "Hevel de Gan",
        "title": "Le Frère Oublié",
        "era": "Tekufat HaShalom (an 925)",
        "description": "Frère de Kayin. Tenta de le détourner des murmures. Échoua. Fut la première victime de la corruption — non par violence, mais par abandon.",
        "fate": "Disparut. Certains disent qu'il erre encore, cherchant à sauver son frère.",
        "legacy": "Symbole de ceux qui essaient et échouent. Patron des pacifistes.",
        "twist_potential": "Oren lui ressemble étrangement..."
      },
      {
        "name": "Miriam HaNevi'ah",
        "title": "La Première Prophétesse",
        "era": "Tekufat HaShalom (an 800-1000)",
        "description": "Seule à avoir prédit la Chute avec exactitude. Personne ne l'écouta. Elle vit la construction de Migdal en pleurant.",
        "fate": "Refusa de quitter Migdal lors de la Tentative. Son corps ne fut jamais retrouvé.",
        "legacy": "Ses prophéties, fragmentées, sont étudiées par les érudits de Tzion.",
        "twist_potential": "Ses prophéties mentionnent 'celui qui marche' (Oren) de manière cryptique."
      },
      {
        "name": "Nimrod HaGibor",
        "title": "Le Puissant",
        "era": "Tekufat HaShalom (an 956-1000)",
        "description": "Roi des Sept Cités unifiées. Celui qui ordonna la construction de Migdal. Pas un homme mauvais — un homme convaincu. Croyait sincèrement que les peuples méritaient de s'élever.",
        "fate": "Fut le premier à atteindre le sommet de Migdal. Fut le premier à comprendre son erreur. Trop tard.",
        "legacy": "Son nom est à la fois maudit et admiré. Les ambitieux l'invoquent, les sages le craignent.",
        "twist_potential": "Son armure existe encore. Celui qui la porte entend ses doutes."
      }
    ],

    "era_rebuilding": [
      {
        "name": "Oren",
        "title": "Le Marcheur (nom public)",
        "true_identity": "Elyon — Le Créateur",
        "era": "Tekufat HaBinyan (an 1247-1289)",
        "description": "Un voyageur qui apparut 247 ans après la Chute. Marcha parmi les peuples. Guérit. Enseigna. Ne demanda jamais rien en retour. Ne se mit jamais en colère. Même face à ceux qui le rejetaient.",
        "fate": "Cessa d'être reconnu. Les récits divergent : trahi ? parti ? oublié ? La vérité est qu'il n'est jamais parti.",
        "legacy": "Chaque tribu a sa propre interprétation d'Oren. Toutes sont partiellement vraies. Aucune n'est complète.",
        "game_presence": "Présent tout au long du jeu comme PNJ discret. Révélé à la fin."
      },
      {
        "name": "Yehuda de Keriot",
        "title": "Le Traître (selon certains) / Le Désespéré (selon d'autres)",
        "era": "Tekufat HaBinyan (an 1289)",
        "description": "Disciple d'Oren qui, selon certains récits, le trahit. La vérité est plus complexe : Yehuda voulait forcer Oren à révéler sa puissance. À sauver le monde par la force.",
        "fate": "Se pendit de désespoir quand il comprit qu'Oren n'avait jamais eu l'intention de régner.",
        "legacy": "Son nom est synonyme de trahison, mais certains le voient comme une victime de son propre désir de justice.",
        "twist_potential": "Un PNJ porte ce fardeau — descendant ou réincarnation symbolique."
      },
      {
        "name": "Shimon Kefa",
        "title": "Le Roc",
        "era": "Tekufat HaBinyan (an 1250-1320)",
        "description": "Le plus fidèle des disciples d'Oren. Celui qui nia le connaître trois fois par peur, puis consacra sa vie à réparer cette faute.",
        "fate": "Fonda la première communauté de ceux qui se souvenaient d'Oren. Mourut en paix.",
        "legacy": "Les Gardiens de la Mémoire se réclament de lui.",
        "twist_potential": "Sa descendance garde un secret sur la vraie nature d'Oren."
      }
    ],

    "era_present": [
      {
        "name": "Général Yoav",
        "title": "L'Épée de Keshet",
        "location": "Ir HaGvul",
        "description": "Commandant militaire de la frontière. Croit que la seule réponse à la corruption est la force. Pas un homme cruel — un homme fatigué qui a vu trop de morts.",
        "alignment": "Neutre-Ordre. Pourrait devenir Bnei HaMa'alah ou Bnei HaTehom selon ses choix.",
        "arc": "Doit apprendre que certaines batailles ne se gagnent pas par l'épée."
      },
      {
        "name": "Prophétesse Devorah",
        "title": "La Voix du Désert",
        "location": "Ir HaMilchamah",
        "description": "Descendante des Bnei Midbar. Entend des voix — parfois Elyon, parfois Tzel'el, parfois elle-même. Ne sait plus toujours distinguer.",
        "alignment": "Neutre-Chaos. Ses prophéties sont vraies mais incompréhensibles.",
        "arc": "Le joueur peut l'aider à retrouver la clarté — ou la perdre avec elle."
      },
      {
        "name": "Ezra le Chroniqueur",
        "title": "Celui Qui Se Souvient",
        "location": "Machaneh HaNitzolim",
        "description": "Vieil homme obsédé par l'idée de reconstituer l'histoire vraie. A passé sa vie à collecter les fragments de vérité.",
        "alignment": "Neutre-Bien. Cherche la vérité à tout prix, même douloureuse.",
        "arc": "Possède des indices sur la vraie nature d'Oren. Les partagera-t-il ?"
      },
      {
        "name": "Tamar la Veuve",
        "title": "Celle Qui Attend",
        "location": "Machaneh HaNitzolim",
        "description": "A perdu son mari dans la Faille. Refuse de croire qu'il est perdu. Attend son retour depuis des années.",
        "alignment": "Neutre. Son espoir est-il foi ou déni ?",
        "arc": "Le joueur découvrira ce qu'est devenu son mari. La vérité sera difficile."
      },
      {
        "name": "Commandant Gideon",
        "title": "Le Marteau",
        "location": "Ir HaMilchamah",
        "description": "Veut attaquer la Faille directement. Détruire Tzel'el par la force. Ignore que c'est impossible.",
        "alignment": "Neutre-Ordre, tendance Bnei HaTehom.",
        "arc": "Sa rage cache une blessure. Son fils est descendu dans la Faille."
      }
    ]
  },

  "the_imitator_forms": {
    "description": "Tzel'el ne se manifeste pas toujours de la même façon",
    "forms": [
      {
        "name": "La Voix",
        "description": "Sa forme la plus commune. Des murmures dans l'esprit. Impossible à distinguer de ses propres pensées.",
        "danger": "Maximum — on ne peut pas combattre ce qu'on ne reconnaît pas"
      },
      {
        "name": "Le Miroir",
        "description": "Parfois, Tzel'el apparaît comme une version de vous-même. Plus confiante. Plus sûre. Plus 'libre'.",
        "danger": "Élevé — il dit ce qu'on veut entendre"
      },
      {
        "name": "Le Conseiller",
        "description": "Rarement, il prend forme humaine. Un inconnu qui donne des conseils sensés... avec un détail qui détourne.",
        "danger": "Moyen — peut être reconnu si on est attentif"
      },
      {
        "name": "Le Roi de l'Abîme",
        "description": "Sa forme 'vraie' dans les Terres d'En-Bas. Magnifique et terrible. Comme une imitation parfaite de la gloire divine — mais vide.",
        "danger": "Confrontation finale — le joueur verra enfin ce qu'il est"
      }
    ]
  }
}
