{
  "_meta": {
    "version": "1.0",
    "last_updated": "2026-01-27",
    "description": "Lore fondamental de Kanarion Online - Histoire chronologique du monde"
  },

  "prologue": {
    "title": "Avant le Temps",
    "chapters": [
      {
        "id": "origin_001",
        "title": "La Parole",
        "text": "Au commencement, il n'y avait rien. Puis vint la Parole. Non pas un son, mais une intention. Le Créateur façonna le monde non par la force, mais par le sens. Chaque chose reçut un nom, et par ce nom, elle trouva sa place. Les terres s'élevèrent. Les eaux furent contenues. Le ciel s'ouvrit. Et la vie prit forme sans crainte."
      },
      {
        "id": "origin_002",
        "title": "Le Premier Témoin",
        "text": "Parmi les premières créatures, l'une fut différente. Elle ne fut pas façonnée pour vivre dans le monde, mais pour le contempler. Elle vit le Créateur à l'œuvre. Elle observa chaque nom donné, chaque vie appelée à l'existence. Et à force de regarder la Lumière, elle crut la comprendre. Elle crut pouvoir la reproduire."
      },
      {
        "id": "origin_003",
        "title": "Les Peuples",
        "text": "Aux peuples, le Créateur donna plus qu'un souffle. Il leur donna une dignité. La capacité de créer, de choisir, d'aimer... et aussi de détruire. Ils furent créés à Son image, non pour Lui ressembler en puissance, mais pour Lui ressembler en responsabilité. Ils reçurent le monde comme un don, et la liberté comme un fardeau sacré."
      },
      {
        "id": "origin_004",
        "title": "L'Harmonie",
        "text": "Et le monde était en harmonie. Les peuples vivaient, travaillaient, se disputaient parfois, mais l'ordre tenait. Le Créateur n'était pas visible, mais Sa présence était une évidence. Dans chaque lever de soleil, dans chaque naissance, dans chaque acte de bonté gratuite. Le mal existait, mais il était contenu, compréhensible, humain."
      }
    ]
  },

  "livre_premier": {
    "title": "Livre Premier — L'Âge de l'Harmonie",
    "subtitle": "Ce qui fut avant la Chute",
    "level_range": [1, 20],
    "chapters": [
      {
        "id": "livre1_001",
        "title": "Le Mensonge du Premier Témoin",
        "text": "Le Premier Témoin — celui qui deviendrait l'Imitateur — ne haïssait pas le Créateur. Il L'admirait. Mais l'admiration devint obsession, et l'obsession devint jalousie. Non pas une jalousie de possession, mais une jalousie d'existence. Pourquoi le Créateur pouvait-Il donner la vie, et pas lui ? Pourquoi les peuples L'aimaient-ils, alors que lui n'était qu'un observateur ?"
      },
      {
        "id": "livre1_002",
        "title": "La Première Imitation",
        "text": "L'Imitateur tenta de créer. Il prit ce qui existait et le remodela. Mais tout ce qu'il façonnait était une copie dégradée. Une imitation sans âme. Les formes étaient là, mais le sens manquait. Et chaque imitation corrompait un peu plus l'original dont elle était tirée. Il ne comprenait pas pourquoi. Il ne comprenait pas que créer n'est pas copier."
      },
      {
        "id": "livre1_003",
        "title": "Le Détournement",
        "text": "Puisqu'il ne pouvait pas créer, l'Imitateur décida de détourner. Si les peuples étaient l'œuvre la plus précieuse du Créateur, alors c'est par eux qu'il frapperait. Non pas en les détruisant — cela aurait été trop simple, trop visible. Mais en les éloignant. En leur murmurant qu'ils pouvaient se passer de leur Créateur. Qu'ils pouvaient devenir leurs propres dieux."
      },
      {
        "id": "livre1_004",
        "title": "Les Murmures Commencent",
        "text": "Les premiers murmures furent doux. Presque raisonnables. Des questions que beaucoup avaient déjà eues, sans jamais oser les formuler. 'Pourquoi attendre ?' 'Pourquoi obéir ?' 'N'êtes-vous pas capables de décider par vous-mêmes ?' L'Imitateur ne mentait pas toujours. Il déformait. Il prenait une vérité et y glissait un doute. Il prenait un doute et en faisait une certitude."
      },
      {
        "id": "livre1_005",
        "title": "La Montée",
        "text": "Avec le temps, le cœur des peuples changea. Ils ne voulurent plus marcher à la suite du Créateur, mais devant Lui. Puis à Sa place. Ils détournèrent les lois du monde, non pour protéger, mais pour dominer. Ils façonnèrent des armes contre le ciel. Ils ouvrirent des portes qu'ils ne comprenaient pas. Ils dirent que la lumière leur appartenait."
      },
      {
        "id": "livre1_006",
        "title": "La Tentative",
        "text": "Et dans leur orgueil, ils tentèrent de tuer Dieu. Non pas avec des lames — comment tuer l'Infini avec du métal ? Mais en Le niant. En Le remplaçant. En construisant si haut qu'ils n'auraient plus besoin de lever les yeux. L'Imitateur les regardait, satisfait. Ce n'était pas lui qui détruisait. C'étaient eux. De leur propre choix. De leur propre volonté."
      },
      {
        "id": "livre1_007",
        "title": "La Chute",
        "text": "Alors le monde fut brisé. Les terres furent purifiées. Les grandes cités englouties. Les œuvres des peuples réduites au silence. Non par haine — comment le Créateur pourrait-Il haïr ce qu'Il a fait ? Mais parce que le mal avait franchi un point de non-retour. Ce ne fut pas une punition. Ce fut une amputation. Pour sauver ce qui pouvait encore l'être."
      },
      {
        "id": "livre1_008",
        "title": "L'Alliance",
        "text": "Pourtant, le Créateur ne retira pas Sa compassion. Au milieu des ruines, Il fit une promesse : 'Je ne détruirai plus la création. Je préparerai sa guérison.' Une alliance fut scellée. Non pas un contrat — les contrats se brisent. Mais un engagement unilatéral. Le Créateur s'engageait, même si les peuples failleraient encore. Et Il annonça la venue de X."
      }
    ]
  },

  "livre_second": {
    "title": "Livre Second — L'Âge du Discernement",
    "subtitle": "Le temps de X et l'après",
    "level_range": [20, 40],
    "chapters": [
      {
        "id": "livre2_001",
        "title": "La Venue de X",
        "text": "X vint en un temps que les chroniques ont oublié. Il ne régna pas. Il ne conquit pas. Il ne s'imposa pas. Il marcha parmi les peuples comme l'un d'entre eux. Il rappela la Parole, non par contrainte, mais par présence. Il guérit les corps, mais surtout les cœurs. Il libéra ceux qui étaient liés."
      },
      {
        "id": "livre2_002",
        "title": "L'Enseignement",
        "text": "X révéla que le mal ne venait pas du Créateur, mais de l'éloignement. Il montra que la violence n'était pas la réponse. Que la domination n'était pas la force. Et que la vérité demandait un prix. Il ne condamna pas ceux qui avaient chuté. Il leur tendit la main. Même à ceux qui refusaient de la prendre."
      },
      {
        "id": "livre2_003",
        "title": "La Réponse de l'Imitateur",
        "text": "L'Imitateur vit X et comprit le danger. Non pas pour lui-même — il ne pouvait être détruit. Mais pour son œuvre. Si les peuples suivaient X, s'ils comprenaient vraiment ce qu'il enseignait, alors tout ce que l'Imitateur avait construit s'effondrerait. Alors il redoubla d'efforts. Il envoya ses plus subtils mensonges. Il dressa des peuples contre X."
      },
      {
        "id": "livre2_004",
        "title": "La Disparition",
        "text": "Puis X disparut. Ou du moins, on cessa de Le reconnaître. Nul ne sut s'Il fut trahi, rejeté, ou simplement ignoré. Il ne resta de Lui que des paroles fragmentées, des gestes transmis, et une promesse inachevée. Les uns dirent qu'Il avait échoué. Les autres qu'Il reviendrait. Et d'autres encore cessèrent simplement d'y penser."
      },
      {
        "id": "livre2_005",
        "title": "Le Monde Malade",
        "text": "Le monde subsista, mais il était malade. Les peuples se divisèrent. La vérité se fragmenta en mille versions. Les souvenirs furent déformés par ceux qui voulaient les utiliser. Et les âmes, liées par la peur, la haine et le mensonge, commencèrent à prendre des formes monstrueuses. Le mal n'était plus seulement un choix. Il devenait visible."
      },
      {
        "id": "livre2_006",
        "title": "Les Questions",
        "text": "C'est dans cet âge que les vrais doutes commencèrent. Non plus les doutes simples de l'Harmonie, mais des questions profondes : 'Pourquoi celui que j'aide me trahit-il ?' 'Pourquoi celui que je protège me fait-il du mal ?' 'Est-ce notre nature ?' 'Où commence vraiment le mal ?' Le joueur qui traverse cet âge n'est plus naïf. Il agit, mais il doute."
      }
    ]
  },

  "livre_troisieme": {
    "title": "Livre Troisième — L'Âge de la Faille",
    "subtitle": "La fracture des cœurs et du monde",
    "level_range": [40, 60],
    "chapters": [
      {
        "id": "livre3_001",
        "title": "Les Murmures S'intensifient",
        "text": "Des pensées apparurent. Pas comme des voix extérieures. Comme des raisonnements intérieurs. Des questions simples, destructrices : 'Pourquoi les innocents meurent-ils ?' 'Pourquoi la faim, la maladie, l'injustice ?' 'A-t-on vraiment tout compris ?' Le verre n'était plus à moitié plein ni vide. Il était brisé. Et personne ne savait plus qui parlait — soi-même, X qui murmurait encore, ou l'Imitateur qui s'était glissé dans les pensées."
      },
      {
        "id": "livre3_002",
        "title": "L'Ouverture de la Faille",
        "text": "La faille ne s'ouvrit pas d'abord dans la terre. Elle s'ouvrit dans les cœurs. Les rancœurs accumulées, les injustices non réparées, les colères étouffées... quelque chose résonna. Puis la terre elle-même se déchira. Et l'Imitateur, pour la première fois depuis des âges, put appeler directement. Non pas en forçant. En proposant."
      },
      {
        "id": "livre3_003",
        "title": "L'Appel de l'Imitateur",
        "text": "'Tu as essayé', murmura-t-il. 'Tu as souffert. Tu as le droit d'être en colère. Pourquoi continuer à porter ce poids ? Pourquoi pardonner encore ? Pourquoi attendre un X qui n'est jamais revenu ?' Il ne niait pas la douleur. Il la validait. Et c'est pour cela que beaucoup l'écoutèrent. Non parce qu'ils étaient mauvais. Mais parce qu'ils étaient blessés."
      },
      {
        "id": "livre3_004",
        "title": "Le Premier Choix",
        "text": "Face à la faille, deux voies s'ouvrirent. Ceux qui restèrent sur la Terre choisirent d'attendre, de protéger, de réparer ce qui pouvait l'être, d'accepter l'injustice sans y répondre par la violence. Ceux qui entrèrent dans la Faille choisirent de se venger, de détruire ce qui avait causé la douleur, de refuser le pardon, de suivre celui qui promettait la justice immédiate."
      },
      {
        "id": "livre3_005",
        "title": "La Certitude des Deux Camps",
        "text": "Le plus terrible fut que chacun était convaincu d'avoir raison. Ceux d'en Haut voyaient ceux d'en Bas comme des traîtres, des faibles qui avaient cédé à la colère. Ceux d'en Bas voyaient ceux d'en Haut comme des hypocrites, des privilégiés qui parlaient de pardon sans avoir jamais vraiment souffert. Et les deux avaient partiellement raison. Et les deux avaient tort."
      },
      {
        "id": "livre3_006",
        "title": "Les Clans se Forment",
        "text": "Des factions émergèrent. Non plus basées sur les territoires ou les peuples, mais sur les réponses à une question fondamentale : que faire face au mal ? Certains prônaient la reconstruction patiente. D'autres la purification violente. D'autres encore le retrait et l'attente. Et d'autres la destruction totale pour renaître de zéro. L'Imitateur souriait. Il n'avait même plus besoin de murmurer. Les peuples se déchiraient tout seuls."
      }
    ]
  },

  "livre_quatrieme": {
    "title": "Livre Quatrième — L'Âge de la Division",
    "subtitle": "La guerre des cœurs",
    "level_range": [60, 80],
    "chapters": [
      {
        "id": "livre4_001",
        "title": "Deux Mondes",
        "text": "Le monde se divisa en deux réalités. Ceux d'en Haut reconstruisaient, soignaient, protégeaient. Mais ils blessaient encore, malgré eux, par leurs choix, par leurs priorités, par leur sentiment d'avoir raison. Ceux d'en Bas détruisaient, purgeaient, attaquaient. Mais derrière leur violence se cachaient une blessure, une attente, un manque que rien ne comblait."
      },
      {
        "id": "livre4_002",
        "title": "La Révélation de l'Imitateur",
        "text": "L'origine de l'Imitateur fut enfin révélée à ceux qui cherchaient la vérité. Le Premier Témoin. Celui qui avait contemplé la création et avait voulu la reproduire. Celui qui, ne pouvant créer, avait choisi de corrompre. Celui qui, par jalousie indirecte, avait murmuré aux peuples qu'ils pouvaient se passer de leur Créateur. Plus d'innocence possible. Plus d'excuse."
      },
      {
        "id": "livre4_003",
        "title": "Le Second Choix",
        "text": "À ceux d'en Haut, une question fut posée : 'Pourquoi te crois-tu meilleur ? Même en voulant faire le bien, tu blesses. N'est-ce pas aussi de l'orgueil ?' À ceux d'en Bas, une autre question : 'Est-ce vraiment qui tu es ? Ou n'es-tu qu'un cœur blessé qui confond justice et vengeance ?' Et pour la première fois, certains changèrent de camp. Non pas par faiblesse. Par lucidité."
      },
      {
        "id": "livre4_004",
        "title": "La Grande Guerre",
        "text": "La guerre éclata. Non pas une guerre du bien contre le mal — ces catégories n'avaient plus de sens. Une guerre des cœurs. Des convictions. Des blessures. Ceux d'en Haut tentaient de sauver ceux d'en Bas par compassion, mais découvraient qu'ils ne pouvaient pas changer les cœurs de force. Ceux d'en Bas attaquaient par rage, manipulés par leur 'dieu imitateur', convaincus de purifier un monde corrompu."
      },
      {
        "id": "livre4_005",
        "title": "La Présence Cachée",
        "text": "Et pendant tout ce temps, X n'était jamais parti. Il ne 'revint' pas. Il n'avait jamais cessé d'être là. Dans certains actes de bonté inexplicable. Dans certains refus de violence. Dans certaines restaurations silencieuses. Même chez ceux d'en Bas, sa voix murmurait encore, mêlée aux autres. 'Tu n'as pas été oublié. Tu peux t'arrêter à tout moment. Ce chemin n'est pas sans retour.'"
      }
    ]
  },

  "epilogue": {
    "title": "Ce qui demeure",
    "chapters": [
      {
        "id": "epilogue_001",
        "title": "La Révélation Finale",
        "text": "À la fin, quand le joueur fait face à l'Imitateur, une vérité éclate. Le compagnon discret qui l'a accompagné depuis le début — celui qui encourageait sans ordonner, qui conseillait sans juger, qui restait présent même dans les pires décisions — était X. Le Créateur Lui-même, marchant aux côtés de Sa création. Non pour empêcher. Non pour forcer. Mais pour accompagner. Jusqu'au bout."
      },
      {
        "id": "epilogue_002",
        "title": "Le Message",
        "text": "'J'étais là', dit X. 'À chaque combat. À chaque défaite. Même quand tu as choisi le mal. Je suis resté. Non pas parce que tu le méritais. Mais parce que c'est qui Je suis. Être pardonné n'efface pas la responsabilité. Mais être aimé change tout.' L'Imitateur, face à cette révélation, n'a pas de réponse. Car il n'a jamais compris l'amour qui ne demande rien en retour."
      },
      {
        "id": "epilogue_003",
        "title": "Le Monde Qui Demeure",
        "text": "Le monde ne sera jamais parfait. Le mal ne disparaît pas totalement. La faille reste ouverte, car les cœurs restent libres. La restauration est locale, fragile, réelle. Le joueur n'est pas un sauveur. Il n'est pas un juge. Il est un témoin responsable. Quelqu'un qui a traversé les âges, fait des choix, porté des conséquences, et compris une chose : le combat n'était pas contre les autres. Ni même contre lui-même seul. Mais contre ce qui domine, lie et détourne."
      }
    ]
  },

  "themes_fondamentaux": {
    "le_mal": "Le mal n'est pas toujours un acte, mais souvent un détournement. L'Imitateur ne crée pas le mal — il détourne le bien. Il ne force pas — il propose. Il ne détruit pas directement — il corrompt.",
    "la_responsabilite": "Être aimé n'efface pas la responsabilité. Les peuples sont libres, et cette liberté a un poids. Les choix ont des conséquences. L'influence n'annule pas la responsabilité — elle la rend plus lourde.",
    "la_grace": "X est présent même quand on ne Le reconnaît pas. Il ne force jamais. Il accompagne. Il reste. Même face aux pires choix. C'est cela qui distingue le Créateur de l'Imitateur : l'un aime sans condition, l'autre promet sans tenir.",
    "le_combat": "Ce n'est pas contre la chair et le sang que l'on lutte, mais contre ce qui domine, asservit et murmure. Le vrai ennemi n'est pas l'autre camp. C'est ce qui nous pousse à voir l'autre comme ennemi."
  },

  "les_murmures": {
    "description": "Les murmures sont des pensées qui apparaissent au joueur. Parfois ce sont ses propres réflexions. Parfois ce sont les encouragements discrets de X. Parfois ce sont les manipulations de l'Imitateur. Le joueur ne sait jamais avec certitude d'où vient la voix — et c'est voulu.",
    "sources": {
      "X": "Encouragements doux, jamais accusateurs. 'Tu peux prendre ton temps.' 'Ce que tu ressens est compréhensible.' 'Tu n'as pas été oublié.'",
      "soi_meme": "Doutes légitimes, fatigue, questions humaines. 'Pourquoi est-ce si difficile ?' 'Ai-je fait le bon choix ?'",
      "imitateur": "Rationalisation, certitude, détournement. 'Tu as le droit d'être en colère.' 'Ils méritent ce qui leur arrive.' 'Pourquoi attendre encore ?'"
    },
    "evolution": {
      "avant_faille": "Les murmures questionnent. Ils fatiguent. Ils sèment le doute.",
      "apres_faille": "Les murmures affirment. Ils enferment. Ils donnent une fausse certitude."
    }
  }
}
