{
  "_meta": {
    "version": "1.0",
    "last_updated": "2026-01-27",
    "description": "Secrets narratifs, twists et révélations — SPOILERS"
  },

  "major_twists": [
    {
      "id": "twist_oren",
      "name": "Oren est Elyon",
      "reveal_timing": "Confrontation finale avec Tzel'el",
      "setup": [
        "Oren est présent dès le tutoriel comme PNJ mineur",
        "Il réapparaît dans CHAQUE zone majeure",
        "Ses dialogues sont toujours encourageants, jamais directifs",
        "Il ne juge jamais, même les pires choix",
        "Indices subtils : il sait des choses impossibles, les monstres l'évitent parfois",
        "Un vieux sage le fixe avec terreur/révérence à Ir HaGvul"
      ],
      "reveal": "Face à Tzel'el, celui-ci reconnaît Oren et montre de la PEUR pour la première fois. Oren révèle qu'il était là depuis le début. Le Créateur n'a jamais abandonné — il marchait aux côtés du joueur.",
      "impact": "Recontextualise TOUT le jeu. Chaque moment où le joueur se sentait seul, il ne l'était pas."
    },
    {
      "id": "twist_keshet",
      "name": "Keshet a survécu grâce à Oren",
      "reveal_timing": "Quête secondaire niveau 40-50",
      "setup": [
        "Keshet est la seule Cité de Lumière à avoir survécu presque intacte",
        "Personne ne sait pourquoi",
        "Les archives de Keshet mentionnent un 'étranger' qui était là la nuit de la Chute"
      ],
      "reveal": "Oren était à Keshet pendant la Chute. Il a interposé sa présence entre la destruction et la ville. C'est pourquoi elle a survécu — pas par mérite, mais par grâce.",
      "impact": "Montre que le Créateur agit même quand personne ne le sait."
    },
    {
      "id": "twist_hevel",
      "name": "Hevel n'est pas mort",
      "reveal_timing": "Donjon de niveau 35-40",
      "setup": [
        "Hevel, frère de Kayin, est supposé avoir 'disparu'",
        "Des légendes parlent d'un fantôme qui erre près des ruines de Migdal",
        "Oren ressemble étrangement à certaines descriptions de Hevel"
      ],
      "reveal": "Hevel erre toujours, incapable de mourir, incapable de sauver son frère. C'est une âme en peine. Le joueur peut l'aider à trouver la paix — ou le laisser errer.",
      "impact": "Premier contact direct avec les conséquences millénaires de la corruption.",
      "sub_twist": "Hevel révèle qu'un voyageur venait parfois lui parler. Un voyageur qui lui ressemblait. Oren."
    },
    {
      "id": "twist_gideon",
      "name": "Le fils de Gideon",
      "reveal_timing": "Quête niveau 55-60",
      "setup": [
        "Commandant Gideon veut attaquer la Faille avec rage",
        "Il refuse d'en parler quand on demande pourquoi",
        "D'autres PNJs mentionnent qu'il a changé il y a 5 ans"
      ],
      "reveal": "Le fils de Gideon, Nathaniel, est descendu dans la Faille. Pas par corruption — par désespoir. Gideon ne veut pas détruire la Faille. Il veut sauver son fils.",
      "choice": "Le joueur peut descendre chercher Nathaniel. Il le trouvera. Mais Nathaniel aura changé. Est-il encore sauvable ?",
      "impact": "Montre que ceux d'en bas ne sont pas des monstres — ce sont des gens blessés."
    },
    {
      "id": "twist_tamar",
      "name": "Le mari de Tamar",
      "reveal_timing": "Quête secondaire niveau 45-50",
      "setup": [
        "Tamar attend le retour de son mari depuis des années",
        "Personne n'ose lui dire la vérité",
        "Son mari, Boaz, était un homme bon"
      ],
      "reveal": "Boaz n'est pas mort. Il est devenu l'un des chefs de Bnei HaTehom. Pas par méchanceté — par conviction que c'était le seul moyen de protéger sa femme d'un monde qu'il voyait s'effondrer.",
      "choice": "Le joueur peut les réunir. Mais que se passe-t-il quand l'espoir rencontre ce qu'il est devenu ?",
      "impact": "Questionne : l'amour suffit-il à racheter ?"
    },
    {
      "id": "twist_devorah",
      "name": "Les voix de Devorah",
      "reveal_timing": "Progressif tout au long du jeu",
      "setup": [
        "Devorah entend des voix et ne sait plus les distinguer",
        "Ses prophéties sont vraies mais chaotiques",
        "Elle semble connaître des choses sur le joueur impossible à savoir"
      ],
      "reveal": "Devorah entend trois voix : Tzel'el (qui manipule), elle-même (qui doute), et une troisième qu'elle n'identifie pas (Oren/Elyon). La troisième voix est toujours la plus douce, la plus facile à ignorer.",
      "impact": "Métaphore de la condition humaine : distinguer les influences."
    },
    {
      "id": "twist_kayin_descendant",
      "name": "La lignée de Kayin",
      "reveal_timing": "Révélation majeure niveau 50+",
      "setup": [
        "Kayin de Nod est présenté comme le Premier Corrompu",
        "Sa lignée est supposée maudite",
        "Un PNJ important a des réactions étranges face à certaines reliques"
      ],
      "reveal": "Un personnage important (possiblement le joueur lui-même, selon les choix de création) est un descendant de Kayin. La malédiction n'est pas le sang — c'est le choix. On peut briser le cycle.",
      "impact": "Montre que le passé ne définit pas le futur."
    },
    {
      "id": "twist_imitator_tragedy",
      "name": "La tragédie de Tzel'el",
      "reveal_timing": "Confrontation finale",
      "setup": [
        "Tzel'el est présenté comme le mal incarné",
        "Ses actions sont monstrueuses",
        "Mais ses murmures contiennent parfois... de la douleur"
      ],
      "reveal": "Tzel'el n'a jamais voulu détruire. Il voulait CRÉER. Il a contemplé la beauté d'Elyon et a voulu la reproduire. Il n'y est jamais parvenu. Chaque imitation était un échec. Et plutôt que d'accepter sa nature, il a choisi de corrompre ce qu'il ne pouvait égaler.",
      "impact": "Le mal n'est pas né de la haine — il est né de l'orgueil blessé.",
      "note": "Cela ne le rend pas moins dangereux. Mais cela le rend... compréhensible."
    }
  ],

  "minor_secrets": [
    {
      "id": "secret_agam",
      "name": "Les lumières du Lac des Larmes",
      "description": "Des plongeurs voient des lumières au fond du lac où Gan'Eden est engloutie. Ce sont les âmes de ceux qui y vivaient. Ils attendent.",
      "discovery": "Quête de plongée niveau 30+"
    },
    {
      "id": "secret_migdal_stones",
      "name": "Les Pierres de Migdal",
      "description": "Les pierres de la Tour contiennent un écho de l'orgueil. Celui qui les porte entend des ambitions qui ne sont pas les siennes.",
      "discovery": "Craft légendaire, avec avertissement"
    },
    {
      "id": "secret_nimrod_armor",
      "name": "L'Armure de Nimrod",
      "description": "L'armure du roi qui ordonna Migdal existe encore. Elle confère une grande puissance — mais aussi ses doutes. On entend sa voix la nuit.",
      "discovery": "Drop de boss raid"
    },
    {
      "id": "secret_ohel",
      "name": "La Tente Invisible",
      "description": "Ohel Mo'ed existe encore. Elle se manifeste parfois à ceux qui ne la cherchent pas. On y entre par accident. On n'en parle jamais après.",
      "discovery": "Event aléatoire très rare"
    },
    {
      "id": "secret_bnei_or",
      "name": "Les Enfants de la Lumière",
      "description": "Les Bnei Or ne sont pas éteints. Ils se sont cachés. Ils attendent quelque chose. Peut-être le retour visible d'Oren.",
      "discovery": "Quête secrète très longue"
    }
  ],

  "narrative_rules": {
    "rule_1": "Aucun camp n'est entièrement juste. Aucun camp n'est entièrement perdu.",
    "rule_2": "X/Oren n'est jamais au centre du pouvoir. Il marche parmi, pas au-dessus.",
    "rule_3": "Le choix du joueur est toujours respecté. Même le mauvais choix a du sens.",
    "rule_4": "Le mal est compréhensible, jamais excusé.",
    "rule_5": "La rédemption est possible. Elle n'est jamais facile.",
    "rule_6": "L'amour d'Elyon est inconditionnel. Cela ne veut pas dire sans conséquences."
  }
}
